export const gejuZhi = ['子', '午', '卯', '酉', '寅', '申', '巳', '亥', '辰', '戌', '丑', '未']

export const images1 = [{
    src: 'https://www.iwzbz.com/spimg/gejutips/geju_content_1.jpg',
    h: '924',
    w: '675',
}, {
    src: 'https://www.iwzbz.com/spimg/gejutips/geju_content_2.jpg',
    h: '1512',
    w: '690',
}, {
    src: 'https://www.iwzbz.com/spimg/gejutips/geju_content_3.jpg',
    h: '1326',
    w: '690',
}]

export const images2 = [{
    src: 'https://www.iwzbz.com/spimg/gejutips/geju_content_4.jpg',
    h: '1162',
    w: '690',
}]

export const images3 = [{
    src: 'https://www.iwzbz.com/spimg/gejutips/geju_content_5.jpg',
    h: '690',
    w: '690',
}, {
    src: 'https://www.iwzbz.com/spimg/gejutips/geju_content_6.jpg',
    h: '1976',
    w: '690',
}]

export const data2 = [{
    text: '若月令发生三合局，则三合局优先于月令取格',
}, {
    text: '若月令发生三会局，则三会局优先于月令取格',
}]

export const data3 = [{
    title: '专旺格',
    text: '曲直格、炎上格、稼穑格、从革格、润下格',
}, {
    title: '从弱格',
    text: '从财格、从杀格、从儿格、从强格',
}]

/**
 * 格局取法默认值
 * @key ylValues: 十二月令
 * @key additionValues：附加规则
 * @key specialValues：特殊格
 * @key ylDatas：月令规则
 */
export const setting_geju_default = {
    ylValues: [0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1],
    additionValues: [true, true],
    specialValues: [true, true],
    ylDatas: [
        [0, 0, 1, 1],
        [0, 0, 1, 1],
        [0, 0, 1, 1],
        [0, 0, 1, 1],
        [0, 0, 1, 1],
        [0, 0, 1, 1],
        [0, 0, 1, 1],
        [0, 0, 1, 1],
        [0, 0, 1, 1, true],
        [0, 0, 1, 1, true],
        [0, 0, 1, 1, true],
        [0, 0, 1, 1, true]
    ]
}

/**
 * 人员司令分野
 */
export const ryslList = [
    {
        id: 1,
        title: '《子平真诠》分日诀：',
        content: '寅：戊七日，丙七日，甲十六日。\n卯：甲十日，乙二十日。\n辰：乙九日，癸三日，戊十八日。\n巳：戊五日，庚九日，丙十六日。\n午：丙十日，己九日，丁十一日。\n未：丁九日，乙三日，己十八日。\n申：戊己十日，壬三日，庚十七日。\n酉：庚十日，辛二十日。\n戌：辛九日，丁三日，戊十八日。\n亥：戊七日，甲五日，壬十八日。\n子：壬十日，癸二十日。\n丑：癸九日，辛三日，己十八日。'
    },
    {
        id: 2,
        title: '《三命通会》分日诀：',
        content: '寅：己七日，丙五日，甲十八日。\n卯：甲九日，癸三日，乙十八日。\n辰：乙九日，癸三日，戊十八日。\n巳：戊七日，庚五日，丙十八日。\n午：丙九日，己三日，丁十八日。\n未：丁七日，乙五日，己十八日。\n申：己七日，戊三日，壬三日，庚十七日。\n酉：庚七日，丁三日，辛二十日。\n戌：辛七日，丁五日，戊十八日。\n亥：戊七日，甲五日，壬十八日。\n子：壬九日，辛三日，癸十八日。\n丑：癸七日，辛五日，己十八日。'
    },
    {
        id: 3,
        title: '《渊海子平》分日诀：',
        content: '寅：戊七日，丙七日，甲十六日。\n卯：甲十日，乙二十日。\n辰：乙九日，癸三日，戊十八日。\n巳：戊五日，庚九日，丙十六日。\n午：丙十日，己十日，丁十日。\n未：丁九日，乙三日，己十八日。\n申：己七日，戊三日，壬三日，庚十七日。\n酉：庚十日，辛二十日。\n戌：辛九日，丁三日，戊十八日。\n亥：戊七日，甲五日，壬十八日。\n子：壬十日，癸二十日。\n丑：癸九日，辛三日，己十八日。'
    },
    {
        id: 4,
        title: '《神峰通考》分日诀：',
        content: '寅：戊七日，丙七日，甲十六日。\n卯：甲十日，乙二十日。\n辰：乙九日，癸三日，戊十八日。\n巳：戊七日，庚七日，丙十六日。\n午：丙十日，己七日，丁十三日。\n未：丁九日，乙三日，己十八日。\n申：戊七日，壬七日，庚十六日。\n酉：庚十日，辛二十日。\n戌：辛九日，丁三日，戊十八日。\n亥：戊七日，甲七日，壬十六日。\n子：壬十日，癸二十日。\n丑：癸九日，辛三日，己十八日。'
    },
    {
        id: 5,
        title: '《星平会海》分日诀：',
        content: '寅：戊七日，丙七日，甲十六日。\n卯：甲十日，乙二十日。\n辰：乙九日，癸三日，戊十八日。\n巳：戊五日，庚九日，丙十六日。\n午：丙十日，己九日，丁十一日。\n未：丁九日，乙二日，己十八日。\n申：己七日，戊三日，壬三日，庚十七日。\n酉：庚十日，辛二十日。\n戌：辛九日，丁三日，戊十八日。\n亥：戊七日，甲五日，壬十八日。\n子：壬十日，癸二十日。\n丑：癸九日，辛三日，己十八日。'
    },
    {
        id: 6,
        title: '万育吾之法诀：',
        content: '寅：己五日，丙五日，甲二十日。\n卯：甲七日，乙二十三日。\n辰：乙七日，壬五日，戊十八日。\n巳：戊七日，庚五日，丙十八日。\n午：丙七日，丁二十三日。\n未：丁七日，甲五日，己十八日。\n申：己五日，壬五日，庚二十日。\n酉：庚七日，辛二十三日。\n戌：辛七日，丙五日，戊十八日。\n亥：戊五日，甲五日，壬二十日。\n子：壬七日，癸二十三日。\n丑：癸七日，庚五日，己十八日。'
    },
]

/**
 * 干支关系 - 天干关系
 */
export const gzRelation_tg = [
    {
        "id": 1,
        "name": "天干相冲",
        "list": [
            {
                "id": 1,
                "name": "甲_庚相冲"
            },
            {
                "id": 2,
                "name": "乙_辛相冲"
            },
            {
                "id": 3,
                "name": "丙_壬相冲"
            },
            {
                "id": 4,
                "name": "丁_癸相冲"
            }
        ]
    },
    {
        "id": 2,
        "name": "天干相克",
        "list": [
            {
                "id": 5,
                "name": "甲_戊相克"
            },
            {
                "id": 6,
                "name": "乙_己相克"
            },
            {
                "id": 7,
                "name": "丙_庚相克"
            },
            {
                "id": 8,
                "name": "丁_辛相克"
            },
            {
                "id": 9,
                "name": "戊_壬相克"
            },
            {
                "id": 10,
                "name": "己_癸相克"
            },
            {
                "id": 11,
                "name": "庚_甲相克"
            },
            {
                "id": 12,
                "name": "辛_乙相克"
            },
            {
                "id": 13,
                "name": "壬_丙相克"
            },
            {
                "id": 14,
                "name": "癸_丁相克"
            }
        ]
    },
    {
        "id": 3,
        "name": "天干五合",
        "list": [
            {
                "id": 15,
                "name": "甲_己合化土"
            },
            {
                "id": 16,
                "name": "乙_庚合化金"
            },
            {
                "id": 17,
                "name": "丙_辛合化水"
            },
            {
                "id": 18,
                "name": "丁_壬合化木"
            },
            {
                "id": 19,
                "name": "戊_癸合化火"
            }
        ]
    }
]

/**
 * 干支关系 - 地支关系
 */
export const gzRelation_dz = [
    {
        "id": 4,
        "name": "地支六合",
        "list": [
            {
                "id": 20,
                "name": "子_丑合化土"
            },
            {
                "id": 21,
                "name": "寅_亥合化木"
            },
            {
                "id": 22,
                "name": "卯_戌合化火"
            },
            {
                "id": 23,
                "name": "辰_酉合化金"
            },
            {
                "id": 24,
                "name": "巳_申合化水"
            },
            {
                "id": 25,
                "name": "午_未合化火"
            }
        ]
    },
    {
        "id": 5,
        "name": "地支三合",
        "lists": [
            {
                "title": "条件：地支会三合局",
                "list": [
                    {
                        "id": 26,
                        "name": "申_子_辰三合水局"
                    },
                    {
                        "id": 27,
                        "name": "寅_午_戌三合火局"
                    },
                    {
                        "id": 28,
                        "name": "巳_酉_丑三合金局"
                    },
                    {
                        "id": 29,
                        "name": "亥_卯_未三合木局"
                    }
                ]
            },
            {
                "title": "条件：地支半合局",
                "list": [
                    {
                        "id": 30,
                        "name": "申_子半合水局"
                    },
                    {
                        "id": 31,
                        "name": "子_辰半合水局"
                    },
                    {
                        "id": 98,
                        "name": "寅_午半合火局"
                    },
                    {
                        "id": 32,
                        "name": "午_戌半合火局"
                    },
                    {
                        "id": 33,
                        "name": "巳_酉半合金局"
                    },
                    {
                        "id": 34,
                        "name": "酉_丑半合金局"
                    },
                    {
                        "id": 35,
                        "name": "亥_卯半合木局"
                    },
                    {
                        "id": 36,
                        "name": "卯_未半合木局"
                    }
                ]
            },
            {
                "title": "条件：地支暗合局",
                "list": [
                    {
                        "id": 37,
                        "name": "地支见申_辰，天干见癸"
                    },
                    {
                        "id": 38,
                        "name": "地支见亥_未，天干见乙"
                    },
                    {
                        "id": 39,
                        "name": "地支见寅_戌，天干见丁"
                    },
                    {
                        "id": 40,
                        "name": "地支见巳_丑，天干见辛"
                    }
                ]
            },
            {
                "title": "条件：地支拱合局",
                "list": [
                    {
                        "id": 41,
                        "name": "申_辰拱合子"
                    },
                    {
                        "id": 42,
                        "name": "亥_未拱合卯"
                    },
                    {
                        "id": 43,
                        "name": "寅_戌拱合午"
                    },
                    {
                        "id": 44,
                        "name": "巳_丑拱合酉"
                    }
                ]
            }
        ]
    },
    {
        "id": 6,
        "name": "地支三会",
        "lists": [
            {
                "title": "条件：地支三会局",
                "list": [
                    {
                        "id": 45,
                        "name": "寅_卯_辰三会木局"
                    },
                    {
                        "id": 46,
                        "name": "巳_午_未三会火局"
                    },
                    {
                        "id": 47,
                        "name": "申_酉_戌三会金局"
                    },
                    {
                        "id": 48,
                        "name": "亥_子_丑三会水局"
                    },
                    {
                        "id": 49,
                        "name": "丑_辰_未_戌合土局"
                    }
                ]
            },
            {
                "title": "条件：地支暗三会局",
                "list": [
                    {
                        "id": 50,
                        "name": "地支见寅_辰，天干见乙"
                    },
                    {
                        "id": 51,
                        "name": "地支见巳_未，天干见丁"
                    },
                    {
                        "id": 52,
                        "name": "地支见申_戌，天干见辛"
                    },
                    {
                        "id": 53,
                        "name": "地支见亥_丑，天干见癸"
                    }
                ]
            },
            {
                "title": "条件：地支拱三会局",
                "list": [
                    {
                        "id": 54,
                        "name": "寅_辰拱会卯"
                    },
                    {
                        "id": 55,
                        "name": "巳_未拱会午"
                    },
                    {
                        "id": 56,
                        "name": "申_戌拱会酉"
                    },
                    {
                        "id": 57,
                        "name": "亥_丑拱会子"
                    }
                ]
            }
        ]
    },
    {
        "id": 7,
        "name": "地支暗合",
        "list": [
            {
                "id": 58,
                "name": "卯_申暗合"
            },
            {
                "id": 59,
                "name": "午_亥暗合"
            },
            {
                "id": 60,
                "name": "丑_寅暗合"
            },
            {
                "id": 61,
                "name": "寅_未暗合"
            },
            {
                "id": 62,
                "name": "子_戌暗合"
            },
            {
                "id": 63,
                "name": "子_辰暗合"
            },
            {
                "id": 64,
                "name": "巳_酉暗合"
            },
            {
                "id": 65,
                "name": "寅_午暗合"
            },
            {
                "id": 66,
                "name": "子_巳暗合"
            }
        ]
    },
    {
        "id": 8,
        "name": "地支相刑",
        "lists": [
            {
                "title": "条件：地支三刑",
                "list": [
                    {
                        "id": 67,
                        "name": "寅_巳_申三刑"
                    },
                    {
                        "id": 68,
                        "name": "丑_戌_未三刑"
                    }
                ]
            },
            {
                "title": "条件：地支相刑",
                "list": [
                    {
                        "id": 69,
                        "name": "寅_巳相刑"
                    },
                    {
                        "id": 70,
                        "name": "巳_申相刑"
                    },
                    {
                        "id": 71,
                        "name": "申_寅相刑"
                    },
                    {
                        "id": 72,
                        "name": "丑_戌相刑"
                    },
                    {
                        "id": 73,
                        "name": "戌_未相刑"
                    },
                    {
                        "id": 74,
                        "name": "未_丑相刑"
                    },
                    {
                        "id": 75,
                        "name": "子_卯相刑"
                    },
                    {
                        "id": 76,
                        "name": "酉_酉相刑"
                    },
                    {
                        "id": 77,
                        "name": "亥_亥相刑"
                    },
                    {
                        "id": 78,
                        "name": "午_午相刑"
                    },
                    {
                        "id": 79,
                        "name": "辰_辰相刑"
                    }
                ]
            }
        ]
    },
    {
        "id": 9,
        "name": "地支相冲",
        "list": [
            {
                "id": 80,
                "name": "子_午相冲"
            },
            {
                "id": 81,
                "name": "丑_未相冲"
            },
            {
                "id": 82,
                "name": "寅_申相冲"
            },
            {
                "id": 83,
                "name": "卯_酉相冲"
            },
            {
                "id": 84,
                "name": "辰_戌相冲"
            },
            {
                "id": 85,
                "name": "巳_亥相冲"
            }
        ]
    },
    {
        "id": 10,
        "name": "地支相破",
        "list": [
            {
                "id": 86,
                "name": "子_酉相破"
            },
            {
                "id": 87,
                "name": "午_卯相破"
            },
            {
                "id": 88,
                "name": "巳_申相破"
            },
            {
                "id": 89,
                "name": "辰_丑相破"
            },
            {
                "id": 90,
                "name": "寅_亥相破"
            },
            {
                "id": 91,
                "name": "戌_未相破"
            }
        ]
    },
    {
        "id": 11,
        "name": "地支相害",
        "list": [
            {
                "id": 92,
                "name": "子_未相害"
            },
            {
                "id": 93,
                "name": "丑_午相害"
            },
            {
                "id": 94,
                "name": "寅_巳相害"
            },
            {
                "id": 95,
                "name": "卯_辰相害"
            },
            {
                "id": 96,
                "name": "申_亥相害"
            },
            {
                "id": 97,
                "name": "酉_戌相害"
            }
        ]
    }
]

/**
 * 干支关系默认值
 * @key tg: 天干关系
 * @key dz: 地支关系
 * @key switch: 开关
 * @key selected: 位置索引
 * @key datas: 条件数据
 */
export const setting_gzrelation_default = {
    "tg": [
        {
            "id": 1,
            "switch": false,
            "selected": 1,
            "datas": [
                "1111"
            ]
        },
        {
            "id": 2,
            "switch": true,
            "selected": 1,
            "datas": [
                "1111111111"
            ]
        },
        {
            "id": 3,
            "switch": true,
            "selected": 1,
            "datas": [
                "11111"
            ]
        }
    ],
    "dz": [
        {
            "id": 4,
            "switch": true,
            "selected": 1,
            "datas": [
                "111111"
            ]
        },
        {
            "id": 5,
            "switch": true,
            "selected": 1,
            "datas": [
                "1111",
                "11111111",
                "1111",
                "1111"
            ]
        },
        {
            "id": 6,
            "switch": true,
            "selected": 1,
            "datas": [
                "11111",
                "1111",
                "1111"
            ]
        },
        {
            "id": 7,
            "switch": true,
            "selected": 1,
            "datas": [
                "111111111"
            ]
        },
        {
            "id": 8,
            "switch": true,
            "selected": 1,
            "datas": [
                "11",
                "11111111111"
            ]
        },
        {
            "id": 9,
            "switch": true,
            "selected": 1,
            "datas": [
                "111111"
            ]
        },
        {
            "id": 10,
            "switch": true,
            "selected": 1,
            "datas": [
                "111111"
            ]
        },
        {
            "id": 11,
            "switch": true,
            "selected": 1,
            "datas": [
                "111111"
            ]
        }
    ]
}

/**
 * 地支藏干默认值
 */
export const setting_dizhizg_default = [
    { id: 'CG_zi', value: '癸' },
    { id: 'CG_chou', value: '己 癸 辛' },
    { id: 'CG_yin', value: '甲 丙 戊' },
    { id: 'CG_mao', value: '乙' },
    { id: 'CG_chen', value: '戊 乙 癸' },
    { id: 'CG_si', value: '丙 庚 戊' },
    { id: 'CG_wu', value: '丁 己' },
    { id: 'CG_wei', value: '己 丁 乙' },
    { id: 'CG_shen', value: '庚 壬 戊' },
    { id: 'CG_you', value: '辛' },
    { id: 'CG_xu', value: '戊 辛 丁' },
    { id: 'CG_hai', value: '壬 甲' },
]

export const ylTitles = [{
    id: 0,
    title: "月令主气直接取格",
}, {
    id: 1,
    title: "论月令透干取格",
}]

/**
 * 地支藏干默认值
 */
export const setting_rysl_default = {
    switch: true,
    selected: 0
}

/**
 * ylData.datas[<i>].titles 如果存在，则根据地支获取索引，如果不存在，则使用ylData.datas[<i>].title；
 * ylData.datas[<i].contents：子元素为数组类型时，根据地支获取索引作为获取子元素的下标
 */
export const ylData = {
    title: "取格原理以月令为核心，查询月令藏干是否透出,藏干的权重优先级为，藏干:本气>中气>余气。因此，月令透干取格法规则的优先级如下:",
    datas: [
        {
            titles: ["（一）月令的主气透出天干", "（一）月令主气直接取格"],
            contents: ["优先主气取格（如寅月透甲，申月透庚）"],
        },
        {
            title: "（二）月令的主气不透，只有一个中气或余气透出",
            contents: ["透出之物取格（如寅月只透丙或只透戊）"],
        },
        {
            title: "（三）月令的主气不透，同时透出中气和余气两藏干",
            contents: ["取中气定格局，因为中气＞余气", ["在两者之间，选择五行力量强者取格", "在两者之间，选中五行力量强者的月令藏干取格"], "兼透则兼用，中余气两个都取格"],
        },
        {
            title: "（四）月令的藏干都不透",
            contents: [["取主气定格局", "月令主气直接取格"], "在三个藏干之间，选择五行力量强者取格"]
        }
    ]
}

export const ylData4_content = "墓库透出，优先墓库取格（如辰月透壬）"

export const specialList = [
    [
        "1、“子午卯酉”和“寅申巳亥”八个月，若主气为比劫，且以主气取格，属于建禄格或羊刃格；若月令的中余气为比劫等同于不透出，不能取格，需另取他格；",
        "2、五行力量强者，数值取之于基本信息页的“五行能量”功能。\n"
    ],
    [
        "1、“辰戌丑未”月若取格之物为比劫，不能取格，需判断其他条件另取其他格；",
        "2、五行力量强者，数值取之于基本信息页的“五行能量”功能。"
    ]
]

export const ylData2 = [
    [
        '不考虑藏干透出的情况，只取月令的主气定格',
        '比如：甲木日元，生于子月，正印格；生于寅月，建禄格'
    ],
    [
        '不考虑藏干透出的情况，只取月令的主气定格',
        '比如：戊土日元，生于申月，食神格；生于亥月，偏财格',
        '特别说明：',
        '“辰戌丑未”四季土月比较特殊，若主气为比劫，不能以主气直接取格，需另取其它格。（比如戊土生于辰月，主气不能取格，需寻其它格）'
    ]
]

export const ssTitleList = [
    {
        id: 0,
        name: '自定神煞'
    },
    {
        id: 1,
        name: '系统神煞'
    },
]

/**
 * 种类Type：(从0开始)
 */
export const sysSSTypes = ["干对干", "干对支", "干对干支", "支对干", "支对支", "支对干支", "干支对干", "干支对支", "干支对干支", "纳音对干", "纳音对支", "纳音对干支", "干支一柱"]

/**
 * 纳音五行
 */
export const nayinWXArr = ['纳音金', '纳音木', '纳音火', '纳音水', '纳音土']

/**
 * 位置-坐对ID
 */
export const ssMainTags = {
    1: '年干', 2: '月干', 3: '日干', 4: '时干', 5: '大运干', 6: '流年干',
    7: '年支', 8: '月支', 9: '日支', 10: '时支', 11: '大运支', 12: '流年支',
    13: '年柱', 14: '月柱', 15: '日柱', 16: '时柱', 17: '年纳音', 18: '天干', 19: '大运柱',
    20: '月纳音', 21: '日纳音', 22: '时纳音', 23: '年干支一柱', 24: '月干支一柱', 25: '日干支一柱', 26: '时干支一柱'
}
export const ssMainTags2 = {
    '年干': 1, '月干': 2, '日干': 3, '时干': 4, '大运干': 5, '流年干': 6,
    '年支': 7, '月支': 8, '日支': 9, '时支': 10, '大运支': 11, '流年支': 12,
    '年柱': 13, '月柱': 14, '日柱': 15, '时柱': 16, '年纳音': 17, '天干': 18, '大运柱': 19,
    '月纳音': 20, '日纳音': 21, '时纳音': 22, '年干支一柱': 23, '月干支一柱': 24, '日干支一柱': 25, '时干支一柱': 26
}

// 神煞顺序表
export const ssSequenceList = ["天乙贵人", "太极贵人", "文昌贵人", "天德贵人", "月德贵人",
    "三奇贵人", "福星贵人", "德秀贵人", "天厨贵人", "国印贵人", "天德合", "月德合", "天罗地网", "天罗", "地网", "十恶大败",
    "阴差阳错", "天赦日", "十灵日", "六秀日", "四废日", "孤鸾煞", "勾绞煞", "红艳煞", "童子煞", "华盖", "驿马", "禄神", "将星",
    "学堂", "正学堂", "词馆", "正词馆", "天医", "金舆", "桃花", "红鸾", "天喜", "金神", "拱禄", "天转日", "地转日", "丧门",
    "吊客", "披麻", "八专日", "九丑日", "元辰", "魁罡日", "孤辰", "寡宿", "流霞", "亡神", "劫煞", "灾煞", "血刃", "飞刃",
    "羊刃", "空亡"]

/**
 * 系统神煞默认数据
 */
export const sysSSList = [{ "id": 1, "name": "天乙贵人", "main": "1,3", "tags": "7,8,9,10,11,12", "sex": "0", "data": { "甲": "丑", "乙": "子", "丙": "亥", "丁": "亥", "戊": "丑", "己": "子", "庚": "丑", "辛": "午", "壬": "巳", "癸": "巳" } }, { "id": 2, "name": "天乙贵人", "main": "1,3", "tags": "7,8,9,10,11,12", "sex": "0", "data": { "甲": "未", "乙": "申", "丙": "酉", "丁": "酉", "戊": "未", "己": "申", "庚": "未", "辛": "寅", "壬": "卯", "癸": "卯" } }, { "id": 3, "name": "太极贵人", "main": "1,3", "tags": "7,8,9,10,11,12", "sex": "0", "data": { "甲": "子", "乙": "子", "丙": "卯", "丁": "卯", "戊": "辰", "己": "辰", "庚": "寅", "辛": "寅", "壬": "巳", "癸": "巳" } }, { "id": 4, "name": "太极贵人", "main": "1,3", "tags": "7,8,9,10,11,12", "sex": "0", "data": { "甲": "午", "乙": "午", "丙": "酉", "丁": "酉", "戊": "丑", "己": "丑", "庚": "亥", "辛": "亥", "壬": "申", "癸": "申" } }, { "id": 5, "name": "太极贵人", "main": "1,3", "tags": "7,8,9,10,11,12", "sex": "0", "data": { "戊": "戌", "己": "戌" } }, { "id": 6, "name": "太极贵人", "main": "1,3", "tags": "7,8,9,10,11,12", "sex": "0", "data": { "戊": "未", "己": "未" } }, { "id": 7, "name": "文昌贵人", "main": "1,3", "tags": "7,8,9,10,11,12", "sex": "0", "data": { "甲": "巳", "乙": "午", "丙": "申", "丁": "酉", "戊": "申", "己": "酉", "庚": "亥", "辛": "子", "壬": "寅", "癸": "卯" } }, { "id": 8, "name": "国印贵人", "main": "1,3", "tags": "7,8,9,10,11,12", "sex": "0", "data": { "甲": "戌", "乙": "亥", "丙": "丑", "丁": "寅", "戊": "丑", "己": "寅", "庚": "辰", "辛": "巳", "壬": "未", "癸": "申" } }, { "id": 9, "name": "金舆", "main": "1,3", "tags": "7,8,9,10,11,12", "sex": "0", "data": { "甲": "辰", "乙": "巳", "丙": "未", "丁": "申", "戊": "未", "己": "申", "庚": "戌", "辛": "亥", "壬": "丑", "癸": "寅" } }, { "id": 12, "name": "禄神", "main": "3", "tags": "7,8,9,10,11,12", "sex": "0", "data": { "甲": "寅", "乙": "卯", "丙": "巳", "丁": "午", "戊": "巳", "己": "午", "庚": "申", "辛": "酉", "壬": "亥", "癸": "子" } }, { "id": 13, "name": "羊刃", "main": "3", "tags": "7,8,9,10,11,12", "sex": "0", "data": { "甲": "卯", "乙": "寅", "丙": "午", "丁": "巳", "戊": "午", "己": "巳", "庚": "酉", "辛": "申", "壬": "子", "癸": "亥" } }, { "id": 14, "name": "飞刃", "main": "3", "tags": "7,8,9,10,11,12", "sex": "0", "data": { "甲": "酉", "乙": "申", "丙": "子", "丁": "亥", "戊": "子", "己": "亥", "庚": "卯", "辛": "寅", "壬": "午", "癸": "巳" } }, { "id": 15, "name": "流霞", "main": "3", "tags": "7,8,9,10,11,12", "sex": "0", "data": { "甲": "酉", "乙": "戌", "丙": "未", "丁": "申", "戊": "巳", "己": "午", "庚": "辰", "辛": "卯", "壬": "亥", "癸": "寅" } }, { "id": 16, "name": "红艳煞", "main": "3", "tags": "7,8,9,10,11,12", "sex": "0", "data": { "甲": "午", "乙": "午", "丙": "寅", "丁": "未", "戊": "辰", "己": "辰", "庚": "戌", "辛": "酉", "壬": "子", "癸": "申" } }, { "id": 17, "name": "驿马", "main": "7", "tags": "8,9,10,11,12", "sex": "0", "data": { "子": "寅", "丑": "亥", "寅": "申", "卯": "巳", "辰": "寅", "巳": "亥", "午": "申", "未": "巳", "申": "寅", "酉": "亥", "戌": "申", "亥": "巳" } }, { "id": 18, "name": "驿马", "main": "9", "tags": "7,8,10,11,12", "sex": "0", "data": { "子": "寅", "丑": "亥", "寅": "申", "卯": "巳", "辰": "寅", "巳": "亥", "午": "申", "未": "巳", "申": "寅", "酉": "亥", "戌": "申", "亥": "巳" } }, { "id": 19, "name": "将星", "main": "7", "tags": "8,9,10,11,12", "sex": "0", "data": { "子": "子", "丑": "酉", "寅": "午", "卯": "卯", "辰": "子", "巳": "酉", "午": "午", "未": "卯", "申": "子", "酉": "酉", "戌": "午", "亥": "卯" } }, { "id": 20, "name": "将星", "main": "9", "tags": "7,8,10,11,12", "sex": "0", "data": { "子": "子", "丑": "酉", "寅": "午", "卯": "卯", "辰": "子", "巳": "酉", "午": "午", "未": "卯", "申": "子", "酉": "酉", "戌": "午", "亥": "卯" } }, { "id": 21, "name": "华盖", "main": "7", "tags": "8,9,10,11,12", "sex": "0", "data": { "子": "辰", "丑": "丑", "寅": "戌", "卯": "未", "辰": "辰", "巳": "丑", "午": "戌", "未": "未", "申": "辰", "酉": "丑", "戌": "戌", "亥": "未" } }, { "id": 22, "name": "华盖", "main": "9", "tags": "7,8,10,11,12", "sex": "0", "data": { "子": "辰", "丑": "丑", "寅": "戌", "卯": "未", "辰": "辰", "巳": "丑", "午": "戌", "未": "未", "申": "辰", "酉": "丑", "戌": "戌", "亥": "未" } }, { "id": 23, "name": "劫煞", "main": "7", "tags": "8,9,10,11,12", "sex": "0", "data": { "子": "巳", "丑": "寅", "寅": "亥", "卯": "申", "辰": "巳", "巳": "寅", "午": "亥", "未": "申", "申": "巳", "酉": "寅", "戌": "亥", "亥": "申" } }, { "id": 24, "name": "劫煞", "main": "9", "tags": "7,8,10,11,12", "sex": "0", "data": { "子": "巳", "丑": "寅", "寅": "亥", "卯": "申", "辰": "巳", "巳": "寅", "午": "亥", "未": "申", "申": "巳", "酉": "寅", "戌": "亥", "亥": "申" } }, { "id": 25, "name": "亡神", "main": "7", "tags": "8,9,10,11,12", "sex": "0", "data": { "子": "亥", "丑": "申", "寅": "巳", "卯": "寅", "辰": "亥", "巳": "申", "午": "巳", "未": "寅", "申": "亥", "酉": "申", "戌": "巳", "亥": "寅" } }, { "id": 26, "name": "亡神", "main": "9", "tags": "7,8,10,11,12", "sex": "0", "data": { "子": "亥", "丑": "申", "寅": "巳", "卯": "寅", "辰": "亥", "巳": "申", "午": "巳", "未": "寅", "申": "亥", "酉": "申", "戌": "巳", "亥": "寅" } }, { "id": 27, "name": "天罗地网", "main": "7", "tags": "8,9,10,11,12", "sex": "0", "data": { "辰": "巳", "巳": "辰", "戌": "亥", "亥": "戌" } }, { "id": 28, "name": "天罗地网", "main": "9", "tags": "7,8,10,11,12", "sex": "0", "data": { "辰": "巳", "巳": "辰", "戌": "亥", "亥": "戌" } }, { "id": 29, "name": "桃花", "main": "7", "tags": "8,9,10,11,12", "sex": "0", "data": { "子": "酉", "丑": "午", "寅": "卯", "卯": "子", "辰": "酉", "巳": "午", "午": "卯", "未": "子", "申": "酉", "酉": "午", "戌": "卯", "亥": "子" } }, { "id": 30, "name": "桃花", "main": "9", "tags": "7,8,10,11,12", "sex": "0", "data": { "子": "酉", "丑": "午", "寅": "卯", "卯": "子", "辰": "酉", "巳": "午", "午": "卯", "未": "子", "申": "酉", "酉": "午", "戌": "卯", "亥": "子" } }, { "id": 31, "name": "灾煞", "main": "7", "tags": "8,9,10,11,12", "sex": "0", "data": { "子": "午", "丑": "卯", "寅": "子", "卯": "酉", "辰": "午", "巳": "卯", "午": "子", "未": "酉", "申": "午", "酉": "卯", "戌": "子", "亥": "酉" } }, { "id": 32, "name": "孤辰", "main": "7", "tags": "8,9,10,11,12", "sex": "0", "data": { "子": "寅", "丑": "寅", "寅": "巳", "卯": "巳", "辰": "巳", "巳": "申", "午": "申", "未": "申", "申": "亥", "酉": "亥", "戌": "亥", "亥": "寅" } }, { "id": 33, "name": "寡宿", "main": "7", "tags": "8,9,10,11,12", "sex": "0", "data": { "子": "戌", "丑": "戌", "寅": "丑", "卯": "丑", "辰": "丑", "巳": "辰", "午": "辰", "未": "辰", "申": "未", "酉": "未", "戌": "未", "亥": "戌" } }, { "id": 34, "name": "勾绞煞", "main": "7", "tags": "8,9,10,11,12", "sex": "0", "data": { "子": "卯", "丑": "辰", "寅": "巳", "卯": "午", "辰": "未", "巳": "申", "午": "酉", "未": "戌", "申": "亥", "酉": "子", "戌": "丑", "亥": "寅" } }, { "id": 35, "name": "天喜", "main": "7", "tags": "8,9,10,11,12", "sex": "0", "data": { "子": "酉", "丑": "申", "寅": "未", "卯": "午", "辰": "巳", "巳": "辰", "午": "卯", "未": "寅", "申": "丑", "酉": "子", "戌": "亥", "亥": "戌" } }, { "id": 36, "name": "红鸾", "main": "7", "tags": "8,9,10,11,12", "sex": "0", "data": { "子": "卯", "丑": "寅", "寅": "丑", "卯": "子", "辰": "亥", "巳": "戌", "午": "酉", "未": "申", "申": "未", "酉": "午", "戌": "巳", "亥": "辰" } }, { "id": 37, "name": "元辰", "main": "7", "tags": "8,9,10,11,12", "sex": "1", "data": { "子": "未", "丑": "申", "寅": "酉", "卯": "戌", "辰": "亥", "巳": "子", "午": "丑", "未": "寅", "申": "卯", "酉": "辰", "戌": "巳", "亥": "午" } }, { "id": 38, "name": "元辰", "main": "7", "tags": "8,9,10,11,12", "sex": "2", "data": { "子": "巳", "丑": "午", "寅": "未", "卯": "申", "辰": "酉", "巳": "戌", "午": "亥", "未": "子", "申": "丑", "酉": "寅", "戌": "卯", "亥": "辰" } }, { "id": 39, "name": "披麻", "main": "7", "tags": "8,9,10,11,12", "sex": "0", "data": { "子": "酉", "丑": "戌", "寅": "亥", "卯": "子", "辰": "丑", "巳": "寅", "午": "卯", "未": "辰", "申": "巳", "酉": "午", "戌": "未", "亥": "申" } }, { "id": 40, "name": "吊客", "main": "7", "tags": "8,9,10,11,12", "sex": "0", "data": { "子": "戌", "丑": "亥", "寅": "子", "卯": "丑", "辰": "寅", "巳": "卯", "午": "辰", "未": "巳", "申": "午", "酉": "未", "戌": "申", "亥": "酉" } }, { "id": 41, "name": "丧门", "main": "7", "tags": "8,9,10,11,12", "sex": "0", "data": { "子": "寅", "丑": "卯", "寅": "辰", "卯": "巳", "辰": "午", "巳": "未", "午": "申", "未": "酉", "申": "戌", "酉": "亥", "戌": "子", "亥": "丑" } }, { "id": 42, "name": "天德贵人", "main": "8", "tags": "1,2,3,4,5", "sex": "0", "data": { "丑": "庚", "寅": "丁", "辰": "壬", "巳": "辛", "未": "甲", "申": "癸", "戌": "丙", "亥": "乙" } }, { "id": 43, "name": "月德贵人", "main": "8", "tags": "1,2,3,4,5,6,7,8,9,10,11,12", "sex": "0", "data": { "子": "壬", "丑": "庚", "寅": "丙", "卯": "甲", "辰": "壬", "巳": "庚", "午": "丙", "未": "甲", "申": "壬", "酉": "庚", "戌": "丙", "亥": "甲" } }, { "id": 44, "name": "天德合", "main": "8", "tags": "1,2,3,4,5", "sex": "0", "data": { "丑": "乙", "寅": "壬", "辰": "丁", "巳": "丙", "未": "己", "申": "戊", "戌": "辛", "亥": "庚" } }, { "id": 45, "name": "月德合", "main": "8", "tags": "1,2,3,4,5", "sex": "0", "data": { "子": "丁", "丑": "乙", "寅": "辛", "卯": "己", "辰": "丁", "巳": "乙", "午": "辛", "未": "己", "申": "丁", "酉": "乙", "戌": "辛", "亥": "己" } }, { "id": 46, "name": "天医", "main": "8", "tags": "7,8,9,10,11,12", "sex": "0", "data": { "子": "亥", "丑": "子", "寅": "丑", "卯": "寅", "辰": "卯", "巳": "辰", "午": "巳", "未": "午", "申": "未", "酉": "申", "戌": "酉", "亥": "戌" } }, { "id": 47, "name": "血刃", "main": "8", "tags": "7,8,9,10,11,12", "sex": "0", "data": { "子": "午", "丑": "子", "寅": "丑", "卯": "未", "辰": "寅", "巳": "申", "午": "卯", "未": "酉", "申": "辰", "酉": "戌", "戌": "巳", "亥": "亥" } }, { "id": 49, "name": "金神", "main": "25,26", "tags": "0", "sex": "0", "data": { "乙丑": "", "癸酉": "", "己巳": "" } }, { "id": 50, "name": "十恶大败", "main": "25", "tags": "0", "sex": "0", "data": { "壬申": "", "庚辰": "", "辛巳": "", "丁亥": "", "己丑": "", "丙申": "", "戊戌": "", "甲辰": "", "乙巳": "", "癸亥": "" } }, { "id": 52, "name": "十灵日", "main": "25", "tags": "0", "sex": "0", "data": { "乙亥": "", "癸未": "", "庚寅": "", "丁酉": "", "壬寅": "", "甲辰": "", "庚戌": "", "辛亥": "", "丙辰": "", "戊午": "" } }, { "id": 53, "name": "阴差阳错", "main": "25", "tags": "0", "sex": "0", "data": { "丙子": "", "丁丑": "", "戊寅": "", "辛卯": "", "壬辰": "", "丙午": "", "丁未": "", "戊申": "", "辛酉": "", "壬戌": "", "癸亥": "", "癸巳": "" } }, { "id": 57, "name": "九丑日", "main": "25", "tags": "0", "sex": "0", "data": { "己卯": "", "壬午": "", "戊子": "", "辛卯": "", "丁酉": "", "己酉": "", "壬子": "", "戊午": "", "辛酉": "" } }, { "id": 58, "name": "魁罡日", "main": "25", "tags": "0", "sex": "0", "data": { "庚辰": "", "壬辰": "", "戊戌": "", "庚戌": "" } }, { "id": 65, "name": "六秀日", "main": "25", "tags": "0", "sex": "0", "data": { "戊子": "", "己丑": "", "丙午": "", "丁未": "", "戊午": "", "己未": "" } }, { "id": 80, "name": "八专日", "main": "25", "tags": "0", "sex": "0", "data": { "戊戌": "", "丁未": "", "癸丑": "", "甲寅": "", "乙卯": "", "己未": "", "庚申": "", "辛酉": "" } }, { "id": 81, "name": "孤鸾煞", "main": "25", "tags": "0", "sex": "0", "data": { "丁巳": "", "乙巳": "", "丙午": "", "戊申": "", "辛亥": "", "壬子": "", "甲寅": "", "戊午": "" } }, { "id": 129, "name": "学堂", "main": "17", "tags": "8,9,10,11,12", "sex": "0", "data": { "金": "巳", "木": "亥", "水": "申", "土": "申", "火": "寅" } }, { "id": 130, "name": "三奇贵人", "main": "18", "tags": "0", "sex": "0", "data": { "甲戊庚": "", "乙丙丁": "", "壬癸辛": "" } }, { "id": 131, "name": "空亡", "main": "13", "tags": "8,9,10,11,12", "sex": "0", "data": { "甲子": "戌", "乙丑": "戌", "丙寅": "戌", "丁卯": "戌", "戊辰": "戌", "己巳": "戌", "庚午": "戌", "辛未": "戌", "壬申": "戌", "癸酉": "戌", "甲戌": "申", "乙亥": "申", "丙子": "申", "丁丑": "申", "戊寅": "申", "己卯": "申", "庚辰": "申", "辛巳": "申", "壬午": "申", "癸未": "申", "甲申": "午", "乙酉": "午", "丙戌": "午", "丁亥": "午", "戊子": "午", "己丑": "午", "庚寅": "午", "辛卯": "午", "壬辰": "午", "癸巳": "午", "甲午": "辰", "乙未": "辰", "丙申": "辰", "丁酉": "辰", "戊戌": "辰", "己亥": "辰", "庚子": "辰", "辛丑": "辰", "壬寅": "辰", "癸卯": "辰", "甲辰": "寅", "乙巳": "寅", "丙午": "寅", "丁未": "寅", "戊申": "寅", "己酉": "寅", "庚戌": "寅", "辛亥": "寅", "壬子": "寅", "癸丑": "寅", "甲寅": "子", "乙卯": "子", "丙辰": "子", "丁巳": "子", "戊午": "子", "己未": "子", "庚申": "子", "辛酉": "子", "壬戌": "子", "癸亥": "子" } }, { "id": 132, "name": "空亡", "main": "15", "tags": "7,8,10,11,12", "sex": "0", "data": { "甲子": "戌", "乙丑": "戌", "丙寅": "戌", "丁卯": "戌", "戊辰": "戌", "己巳": "戌", "庚午": "戌", "辛未": "戌", "壬申": "戌", "癸酉": "戌", "甲戌": "申", "乙亥": "申", "丙子": "申", "丁丑": "申", "戊寅": "申", "己卯": "申", "庚辰": "申", "辛巳": "申", "壬午": "申", "癸未": "申", "甲申": "午", "乙酉": "午", "丙戌": "午", "丁亥": "午", "戊子": "午", "己丑": "午", "庚寅": "午", "辛卯": "午", "壬辰": "午", "癸巳": "午", "甲午": "辰", "乙未": "辰", "丙申": "辰", "丁酉": "辰", "戊戌": "辰", "己亥": "辰", "庚子": "辰", "辛丑": "辰", "壬寅": "辰", "癸卯": "辰", "甲辰": "寅", "乙巳": "寅", "丙午": "寅", "丁未": "寅", "戊申": "寅", "己酉": "寅", "庚戌": "寅", "辛亥": "寅", "壬子": "寅", "癸丑": "寅", "甲寅": "子", "乙卯": "子", "丙辰": "子", "丁巳": "子", "戊午": "子", "己未": "子", "庚申": "子", "辛酉": "子", "壬戌": "子", "癸亥": "子" } }, { "id": 133, "name": "空亡", "main": "13", "tags": "8,9,10,11,12", "sex": "0", "data": { "甲子": "亥", "乙丑": "亥", "丙寅": "亥", "丁卯": "亥", "戊辰": "亥", "己巳": "亥", "庚午": "亥", "辛未": "亥", "壬申": "亥", "癸酉": "亥", "甲戌": "酉", "乙亥": "酉", "丙子": "酉", "丁丑": "酉", "戊寅": "酉", "己卯": "酉", "庚辰": "酉", "辛巳": "酉", "壬午": "酉", "癸未": "酉", "甲申": "未", "乙酉": "未", "丙戌": "未", "丁亥": "未", "戊子": "未", "己丑": "未", "庚寅": "未", "辛卯": "未", "壬辰": "未", "癸巳": "未", "甲午": "巳", "乙未": "巳", "丙申": "巳", "丁酉": "巳", "戊戌": "巳", "己亥": "巳", "庚子": "巳", "辛丑": "巳", "壬寅": "巳", "癸卯": "巳", "甲辰": "卯", "乙巳": "卯", "丙午": "卯", "丁未": "卯", "戊申": "卯", "己酉": "卯", "庚戌": "卯", "辛亥": "卯", "壬子": "卯", "癸丑": "卯", "甲寅": "丑", "乙卯": "丑", "丙辰": "丑", "丁巳": "丑", "戊午": "丑", "己未": "丑", "庚申": "丑", "辛酉": "丑", "壬戌": "丑", "癸亥": "丑" } }, { "id": 134, "name": "空亡", "main": "15", "tags": "7,8,10,11,12", "sex": "0", "data": { "甲子": "亥", "乙丑": "亥", "丙寅": "亥", "丁卯": "亥", "戊辰": "亥", "己巳": "亥", "庚午": "亥", "辛未": "亥", "壬申": "亥", "癸酉": "亥", "甲戌": "酉", "乙亥": "酉", "丙子": "酉", "丁丑": "酉", "戊寅": "酉", "己卯": "酉", "庚辰": "酉", "辛巳": "酉", "壬午": "酉", "癸未": "酉", "甲申": "未", "乙酉": "未", "丙戌": "未", "丁亥": "未", "戊子": "未", "己丑": "未", "庚寅": "未", "辛卯": "未", "壬辰": "未", "癸巳": "未", "甲午": "巳", "乙未": "巳", "丙申": "巳", "丁酉": "巳", "戊戌": "巳", "己亥": "巳", "庚子": "巳", "辛丑": "巳", "壬寅": "巳", "癸卯": "巳", "甲辰": "卯", "乙巳": "卯", "丙午": "卯", "丁未": "卯", "戊申": "卯", "己酉": "卯", "庚戌": "卯", "辛亥": "卯", "壬子": "卯", "癸丑": "卯", "甲寅": "丑", "乙卯": "丑", "丙辰": "丑", "丁巳": "丑", "戊午": "丑", "己未": "丑", "庚申": "丑", "辛酉": "丑", "壬戌": "丑", "癸亥": "丑" } }, { "id": 135, "name": "天罗", "main": "17", "tags": "9,11,12", "sex": "0", "data": { "火": "戌、亥" } }, { "id": 136, "name": "地网", "main": "17", "tags": "9,11,12", "sex": "0", "data": { "水": "辰、巳", "土": "辰、巳" } }, { "id": 137, "name": "天转日", "main": "8", "tags": "15", "sex": "0", "data": { "寅": "乙卯", "卯": "乙卯", "辰": "乙卯", "巳": "丙午", "午": "丙午", "未": "丙午", "申": "辛酉", "酉": "辛酉", "戌": "辛酉", "亥": "壬子", "子": "壬子", "丑": "壬子" } }, { "id": 138, "name": "地转日", "main": "8", "tags": "15", "sex": "0", "data": { "寅": "辛卯", "卯": "辛卯", "辰": "辛卯", "巳": "戊午", "午": "戊午", "未": "戊午", "申": "癸酉", "酉": "癸酉", "戌": "癸酉", "亥": "丙子", "子": "丙子", "丑": "丙子" } }, { "id": 139, "name": "词馆", "main": "17", "tags": "8,9,10,11,12", "sex": "0", "data": { "金": "申", "木": "寅", "水": "亥", "土": "亥", "火": "巳" } }, { "id": 140, "name": "童子煞", "main": "8", "tags": "9,10", "sex": "0", "data": { "子": "卯未辰", "丑": "卯未辰", "寅": "寅子", "卯": "寅子", "辰": "寅子", "巳": "卯未辰", "午": "卯未辰", "未": "卯未辰", "申": "寅子", "酉": "寅子", "戌": "寅子", "亥": "卯未辰" } }, { "id": 143, "name": "童子煞", "main": "17", "tags": "9,10", "sex": "0", "data": { "金": "午、卯", "木": "午、卯", "水": "酉、戌", "火": "酉、戌", "土": "辰、巳" } }, { "id": 144, "name": "天赦日", "main": "8", "tags": "15", "sex": "0", "data": { "寅": "戊寅", "卯": "戊寅", "辰": "戊寅", "巳": "甲午", "午": "甲午", "未": "甲午", "申": "戊申", "酉": "戊申", "戌": "戊申", "亥": "甲子", "子": "甲子", "丑": "甲子" } }, { "id": 146, "name": "四废日", "main": "8", "tags": "15", "sex": "0", "data": { "寅": "庚申", "卯": "庚申", "辰": "庚申", "巳": "壬子", "午": "壬子", "未": "壬子", "申": "甲寅", "酉": "甲寅", "戌": "甲寅", "亥": "丙午", "子": "丙午", "丑": "丙午" } }, { "id": 147, "name": "四废日", "main": "8", "tags": "15", "sex": "0", "data": { "寅": "辛酉", "卯": "辛酉", "辰": "辛酉", "巳": "癸亥", "午": "癸亥", "未": "癸亥", "申": "乙卯", "酉": "乙卯", "戌": "乙卯", "亥": "丁巳", "子": "丁巳", "丑": "丁巳" } }, { "id": 148, "name": "天厨贵人", "main": "1,3", "tags": "7,8,9,10,11,12", "sex": "0", "data": { "甲": "巳", "乙": "午", "丙": "巳", "丁": "午", "戊": "申", "己": "酉", "庚": "亥", "辛": "子", "壬": "寅", "癸": "卯" } }, { "id": 149, "name": "福星贵人", "main": "1,3", "tags": "7,8,9,10,11,12", "sex": "0", "data": { "甲": "寅子", "丙": "寅子", "乙": "卯丑", "癸": "卯丑", "戊": "申", "己": "未", "丁": "亥", "庚": "午", "辛": "巳", "壬": "辰" } }, { "id": 150, "name": "德秀贵人", "main": "8", "tags": "1,2,3,4,5,6", "sex": "0", "data": { "寅": "丙丁戊癸", "午": "丙丁戊癸", "戌": "丙丁戊癸", "申": "壬癸戊己丙辛甲", "子": "壬癸戊己丙辛甲", "辰": "壬癸戊己丙辛甲", "巳": "乙庚辛", "酉": "乙庚辛", "丑": "乙庚辛", "亥": "甲乙丁壬", "卯": "甲乙丁壬", "未": "甲乙丁壬" } }, { "id": 151, "name": "拱禄", "main": "16", "tags": "15", "sex": "0", "data": { "癸丑": "癸亥", "癸亥": "癸丑", "丁未": "丁巳", "己巳": "己未", "戊午": "戊辰" } }, { "id": 153, "name": "正学堂", "main": "17", "tags": "14,15,16,19", "sex": "0", "data": { "金": "辛巳", "木": "己亥", "水": "甲申", "土": "戊申", "火": "丙寅" } }, { "id": 154, "name": "正词馆", "main": "17", "tags": "14,15,16,19", "sex": "0", "data": { "金": "壬申", "木": "庚寅", "水": "癸亥", "土": "丁亥", "火": "乙巳" } }, { "id": 155, "name": "天德贵人", "main": "8", "tags": "7,8,9,10,11", "sex": "0", "data": { "子": "巳", "卯": "申", "午": "亥", "酉": "寅" } }, { "id": 156, "name": "天德合", "main": "8", "tags": "7,8,9,10,11", "sex": "0", "data": { "子": "申", "卯": "巳", "午": "寅", "酉": "亥" } }]

const ssMap = new Map()
ssSequenceList.forEach((item, index) => {
    ssMap.set(item, index)
})
sysSSList.sort((a, b) => ssMap.get(a.name) - ssMap.get(b.name))