function getGuji1_branch(bz) {
    let ret = [];
    if (getIndex1_1(bz)>-1) {
        let item1 = {"value": "论" + bz[4] + "生" + bz[3] + "月", "index": 0}
        ret.push(item1);
        
    }
    return ret;
}

function getGuji2_branch(bz, geju) {
    let ret = [];
    if (getIndex2_1(bz)>-1) {
        let item1 = {"value": "论" + bz[4] + "日干", "index": 0}
        ret.push(item1);
    }
    if (geju) {
        let gejuarr = geju.split(",");
        for (let i = 0; i < gejuarr.length; i++) {
            let gejuItem = gejuarr[i];
            gejuItem = gejuItem.replace("格", "")
            let gujiList = getBookGuJi2(gejuItem)
            for (let j = 0; j < gujiList.length; j++) {
                const gujiTmp = gujiList[j];
                if (ret.indexOf(gujiTmp)) {
                    let gujiDic = {"value": gujiTmp, "index": 1}
                    ret.push(gujiDic)
                }
            }
        }
    }
    return ret;
}

function getGuji3_branch(bz) {
    let ret = [];
    let item1 = {"value": bz[4] + bz[5] + "日" + bz[6] + bz[7] + "时", "index": 0}
    let item2 = {"value": "论" + bz[4] + "日干", "index": 1}
    let item3 = {"value": "论" + bz[4] + "生" + bz[3] + "月", "index": 2}
    let item4 = {"value": "论" + wxForBz(bz[4]) + "生" + bz[3] + "月", "index": 3}
    ret.push(item1);
    ret.push(item2);
    ret.push(item3);
    ret.push(item4);
    return ret;
}

function getGuji4_branch(bz) {
    let ret = [];
    if (getIndex4_1(bz)>-1) {
        let item1 = {"value": bz[3] + "月" + bz[4] + "日" + bz[6] + bz[7] + "时", "index": 0};
        ret.push(item1);
    }
    return ret;
}

function getGuji5_branch(bz, geju) {
    let ret = [];
    if (geju) {
        let gejuarr = geju.split(",");
        for (let i = 0; i < gejuarr.length; i++) {
            let gejuItem = gejuarr[i];
            gejuItem = gejuItem.replace("格", "")
            let gujiList = getBookGeJi5(gejuItem, bz)
            for (let j = 0; j < gujiList.length; j++) {
                const gujiTmp = gujiList[j];
                if (ret.indexOf(gujiTmp)) {
                    let gujiDic = {"value": gujiTmp, "index": 0}
                    ret.push(gujiDic)
                }
            }
        }
    }
    return ret;
}

function getGuji6_branch(bz, geju) {
    let ret = [];
    if (geju) {
        let gejuarr = geju.split(",");
        for (let i = 0; i < gejuarr.length; i++) {
            let gejuItem = gejuarr[i];
            gejuItem = gejuItem.replace("格", "")
            let gujiList = getBookGeJu6(gejuItem)
            for (let j = 0; j < gujiList.length; j++) {
                const gujiTmp = gujiList[j];
                if (ret.indexOf(gujiTmp)) {
                    let gujiDic = {"value": gujiTmp, "index": 0}
                    ret.push(gujiDic)
                }
            }
        }
    }
    let item1 = "论日干" + bz[4];
    let item2 = "论" + bz[3] + "月";
    let item3 = getIndex6_4_Title(bz)
    ret.push({"value": item1, "index": 1});
    ret.push({"value": item2, "index": 2});
    ret.push({"value": item3, "index": 3});
    return ret;
}

function getGuji7_branch(bz) {
    let ret = [];
    let item1 = bz[4] + bz[5] + "日柱"
    let item2 = bz[6] + bz[7] + "时柱"
    let item3 = bz[4] + wxForBz(bz[4]) + "总论"
    ret.push({"value": item1, "index": 0});
    ret.push({"value": item2, "index": 1});
    ret.push({"value": item3, "index": 2});
    return ret;
}

function getGuji8_branch(bz) {
    let ret = [];
    let item1 = "金不换髓歌"
    let item2 = bz[4] + wxForBz(bz[4]) + "体象"
    let item3 = "十二宫支咏"
    ret.push({"value": item1, "index": 0});
    ret.push({"value": item2, "index": 1});
    ret.push({"value": item3, "index": 2});
    return ret;
}

function getGuji9_branch(bz, geju) {
    let ret = [];
    if (geju) {
        let gejuarr = geju.split(",");
        for (let i = 0; i < gejuarr.length; i++) {
            let gejuItem = gejuarr[i];
            gejuItem = gejuItem.replace("格", "")
            let gujiList = getBookGeJi9(gejuItem)
            for (let j = 0; j < gujiList.length; j++) {
                const gujiTmp = gujiList[j];
                if (ret.indexOf(gujiTmp)) {
                    let gujiDic = {"value": gujiTmp, "index": 0}
                    ret.push(gujiDic)
                }
            }
        }
    }
    return ret;
}

function getGuji10_branch(bz) {
    let ret = [];
    let item1 = "论日柱" + bz[4] + bz[5]
    let item2 = "论年柱" + bz[0] + bz[1]
    let item3 = "论日干" + bz[4]
    let item4 = "论日干" + wxForBz(bz[4])
    let item5 = "论" + bz[4] + bz[5] + "日" + bz[6] + bz[7] + "时"
    let item6 = getIndex10_6_Title(bz)
    ret.push({"value": item1, "index": 0});
    ret.push({"value": item2, "index": 1});
    ret.push({"value": item3, "index": 2});
    ret.push({"value": item4, "index": 3});
    ret.push({"value": item5, "index": 4});
    ret.push({"value": item6, "index": 5});
    return ret;
}

function getGuji11_branch(bz) {
    let ret = [];
    let item1 = "论日柱" + bz[4] + bz[5]
    let item2 = "论年柱" + bz[0] + bz[1]
    ret.push({"value": item1, "index": 0});
    ret.push({"value": item2, "index": 1});
    return ret;
}

function getIndex1_1(bz) {
    let indexStr = "甲寅\n" +
        "甲卯\n" +
        "甲辰\n" +
        "甲巳\n" +
        "甲午\n" +
        "甲未\n" +
        "甲申\n" +
        "甲酉\n" +
        "甲戌\n" +
        "甲亥\n" +
        "甲子\n" +
        "甲丑\n" +
        "乙寅\n" +
        "乙卯\n" +
        "乙辰\n" +
        "乙巳\n" +
        "乙午\n" +
        "乙未\n" +
        "乙申\n" +
        "乙酉\n" +
        "乙戌\n" +
        "乙亥\n" +
        "乙子\n" +
        "乙丑\n" +
        "丙寅\n" +
        "丙卯\n" +
        "丙辰\n" +
        "丙巳\n" +
        "丙午\n" +
        "丙未\n" +
        "丙申\n" +
        "丙酉\n" +
        "丙戌\n" +
        "丙亥\n" +
        "丙子\n" +
        "丙丑\n" +
        "丁寅\n" +
        "丁卯\n" +
        "丁辰\n" +
        "丁巳\n" +
        "丁午\n" +
        "丁未\n" +
        "丁申\n" +
        "丁酉\n" +
        "丁戌\n" +
        "丁亥\n" +
        "丁子\n" +
        "丁丑\n" +
        "戊寅\n" +
        "戊卯\n" +
        "戊辰\n" +
        "戊巳\n" +
        "戊午\n" +
        "戊未\n" +
        "戊申\n" +
        "戊酉\n" +
        "戊戌\n" +
        "戊亥\n" +
        "戊子\n" +
        "戊丑\n" +
        "己寅\n" +
        "己卯\n" +
        "己辰\n" +
        "己巳\n" +
        "己午\n" +
        "己未\n" +
        "己申\n" +
        "己酉\n" +
        "己戌\n" +
        "己亥\n" +
        "己子\n" +
        "己丑\n" +
        "庚寅\n" +
        "庚卯\n" +
        "庚辰\n" +
        "庚巳\n" +
        "庚午\n" +
        "庚未\n" +
        "庚申\n" +
        "庚酉\n" +
        "庚戌\n" +
        "庚亥\n" +
        "庚子\n" +
        "庚丑\n" +
        "辛寅\n" +
        "辛卯\n" +
        "辛辰\n" +
        "辛巳\n" +
        "辛午\n" +
        "辛未\n" +
        "辛申\n" +
        "辛酉\n" +
        "辛戌\n" +
        "辛亥\n" +
        "辛子\n" +
        "辛丑\n" +
        "壬寅\n" +
        "壬卯\n" +
        "壬辰\n" +
        "壬巳\n" +
        "壬午\n" +
        "壬未\n" +
        "壬申\n" +
        "壬酉\n" +
        "壬戌\n" +
        "壬亥\n" +
        "壬子\n" +
        "壬丑\n" +
        "癸寅\n" +
        "癸卯\n" +
        "癸辰\n" +
        "癸巳\n" +
        "癸午\n" +
        "癸未\n" +
        "癸申\n" +
        "癸酉\n" +
        "癸戌\n" +
        "癸亥\n" +
        "癸子\n" +
        "癸丑";
    let arr = indexStr.split("\n")
    let ret = -1;
    let gzStr = bz[4] + bz[3];
    for (let i = 0; i < arr.length; i++) {
        const item = arr[i];
        if (item == gzStr) {
            ret = i + 1;
            break
        }
    }
    return ret;
}

function getBookGuJi2(geju) {
    let mapData = {
        "论正官格": ["正官", "杂气正官"],
        "论七杀格": ["七杀", "杂气七杀"],
        "论伤官格": ["伤官", "杂气伤官"],
        "论杂气财官格": ["杂气正官", "杂气七杀", "杂气正财", "杂气偏财"],
        "论从儿格": ["从儿", "疑似从儿"],
        "论真从假从": ["从儿", "疑似从儿", "从杀", "疑似从杀", "从财", "疑似从财", "专旺", "疑似专旺", "炎上", "疑似炎上", "润下", "疑似润下", "稼穑", "疑似稼穑", "从革", "疑似从革", "曲直", "疑似曲直"],
        "论方局": ["三合会"],
        "论一行独气": ["专旺", "疑似专旺", "炎上", "疑似炎上", "润下", "疑似润下", "稼穑", "疑似稼穑", "从革", "疑似从革", "曲直", "疑似曲直"],
    }
    let ret = [];
    for (const key in mapData) {
        if (Object.hasOwnProperty.call(mapData, key)) {
            const element = mapData[key];
            for (let i = 0; i < element.length; i++) {
                const item = element[i];
                if (item == geju) {
                    if (ret.indexOf(key)) {
                        ret.push(key)
                    }
                }
            }
        }
    }
    return ret
}

function getIndex2_1(bz) {
    let arr = ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"];
    let ret = -1;
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] == bz[4]) {
            ret = i + 1;
            break;
        }
    }
    return ret;
}

function getIndex2_2(bz,geju) {
    let arr = ["论正官格", "论七杀格", "论伤官格", "论杂气财官格", "论从儿格", "论真从假从", "论方局", "论一行独气"];
    let ret = -1;
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] == geju) {
            ret = i + 1;
            break;
        }
    }
    return ret;
}

function getIndex3_1(bz) {
    let indexStr = "甲子甲子\n" +
    "甲寅甲子\n" +
    "甲辰甲子\n" +
    "甲午甲子\n" +
    "甲申甲子\n" +
    "甲戌甲子\n" +
    "甲子乙丑\n" +
    "甲寅乙丑\n" +
    "甲辰乙丑\n" +
    "甲午乙丑\n" +
    "甲申乙丑\n" +
    "甲戌乙丑\n" +
    "甲子丙寅\n" +
    "甲寅丙寅\n" +
    "甲辰丙寅\n" +
    "甲午丙寅\n" +
    "甲申丙寅\n" +
    "甲戌丙寅\n" +
    "甲子丁卯\n" +
    "甲寅丁卯\n" +
    "甲辰丁卯\n" +
    "甲午丁卯\n" +
    "甲申丁卯\n" +
    "甲戌丁卯\n" +
    "甲子戊辰\n" +
    "甲寅戊辰\n" +
    "甲辰戊辰\n" +
    "甲午戊辰\n" +
    "甲申戊辰\n" +
    "甲戌戊辰\n" +
    "甲子己巳\n" +
    "甲寅己巳\n" +
    "甲辰己巳\n" +
    "甲午己巳\n" +
    "甲申己巳\n" +
    "甲戌己巳\n" +
    "甲子庚午\n" +
    "甲寅庚午\n" +
    "甲辰庚午\n" +
    "甲午庚午\n" +
    "甲申庚午\n" +
    "甲戌庚午\n" +
    "甲子辛未\n" +
    "甲寅辛未\n" +
    "甲辰辛未\n" +
    "甲午辛未\n" +
    "甲申辛未\n" +
    "甲戌辛未\n" +
    "甲子壬申\n" +
    "甲寅壬申\n" +
    "甲辰壬申\n" +
    "甲午壬申\n" +
    "甲申壬申\n" +
    "甲戌壬申\n" +
    "甲子癸酉\n" +
    "甲寅癸酉\n" +
    "甲辰癸酉\n" +
    "甲午癸酉\n" +
    "甲申癸酉\n" +
    "甲戌癸酉\n" +
    "甲子甲戌\n" +
    "甲寅甲戌\n" +
    "甲辰甲戌\n" +
    "甲午甲戌\n" +
    "甲申甲戌\n" +
    "甲戌甲戌\n" +
    "甲子乙亥\n" +
    "甲寅乙亥\n" +
    "甲辰乙亥\n" +
    "甲午乙亥\n" +
    "甲申乙亥\n" +
    "甲戌乙亥\n" +
    "乙丑丙子\n" +
    "乙卯丙子\n" +
    "乙巳丙子\n" +
    "乙未丙子\n" +
    "乙酉丙子\n" +
    "乙亥丙子\n" +
    "乙丑丁丑\n" +
    "乙卯丁丑\n" +
    "乙巳丁丑\n" +
    "乙未丁丑\n" +
    "乙酉丁丑\n" +
    "乙亥丁丑\n" +
    "乙丑戊寅\n" +
    "乙卯戊寅\n" +
    "乙巳戊寅\n" +
    "乙未戊寅\n" +
    "乙酉戊寅\n" +
    "乙亥戊寅\n" +
    "乙丑己卯\n" +
    "乙卯己卯\n" +
    "乙巳己卯\n" +
    "乙未己卯\n" +
    "乙酉己卯\n" +
    "乙亥己卯\n" +
    "乙丑庚辰\n" +
    "乙卯庚辰\n" +
    "乙巳庚辰\n" +
    "乙未庚辰\n" +
    "乙酉庚辰\n" +
    "乙亥庚辰\n" +
    "乙丑辛巳\n" +
    "乙卯辛巳\n" +
    "乙巳辛巳\n" +
    "乙未辛巳\n" +
    "乙酉辛巳\n" +
    "乙亥辛巳\n" +
    "乙丑壬午\n" +
    "乙卯壬午\n" +
    "乙巳壬午\n" +
    "乙未壬午\n" +
    "乙酉壬午\n" +
    "乙亥壬午\n" +
    "乙丑癸未\n" +
    "乙卯癸未\n" +
    "乙巳癸未\n" +
    "乙未癸未\n" +
    "乙酉癸未\n" +
    "乙亥癸未\n" +
    "乙丑甲申\n" +
    "乙卯甲申\n" +
    "乙巳甲申\n" +
    "乙未甲申\n" +
    "乙酉甲申\n" +
    "乙亥甲申\n" +
    "乙丑乙酉\n" +
    "乙卯乙酉\n" +
    "乙巳乙酉\n" +
    "乙未乙酉\n" +
    "乙酉乙酉\n" +
    "乙亥乙酉\n" +
    "乙丑丙戌\n" +
    "乙卯丙戌\n" +
    "乙巳丙戌\n" +
    "乙未丙戌\n" +
    "乙酉丙戌\n" +
    "乙亥丙戌\n" +
    "乙丑丁亥\n" +
    "乙卯丁亥\n" +
    "乙巳丁亥\n" +
    "乙未丁亥\n" +
    "乙酉丁亥\n" +
    "乙亥丁亥\n" +
    "丙子戊子\n" +
    "丙寅戊子\n" +
    "丙辰戊子\n" +
    "丙午戊子\n" +
    "丙申戊子\n" +
    "丙戌戊子\n" +
    "丙子己丑\n" +
    "丙寅己丑\n" +
    "丙辰己丑\n" +
    "丙午己丑\n" +
    "丙申己丑\n" +
    "丙戌己丑\n" +
    "丙子庚寅\n" +
    "丙寅庚寅\n" +
    "丙辰庚寅\n" +
    "丙午庚寅\n" +
    "丙申庚寅\n" +
    "丙戌庚寅\n" +
    "丙子辛卯\n" +
    "丙寅辛卯\n" +
    "丙辰辛卯\n" +
    "丙午辛卯\n" +
    "丙申辛卯\n" +
    "丙戌辛卯\n" +
    "丙子壬辰\n" +
    "丙寅壬辰\n" +
    "丙辰壬辰\n" +
    "丙午壬辰\n" +
    "丙申壬辰\n" +
    "丙戌壬辰\n" +
    "丙子癸巳\n" +
    "丙寅癸巳\n" +
    "丙辰癸巳\n" +
    "丙午癸巳\n" +
    "丙申癸巳\n" +
    "丙戌癸巳\n" +
    "丙子甲午\n" +
    "丙寅甲午\n" +
    "丙辰甲午\n" +
    "丙午甲午\n" +
    "丙申甲午\n" +
    "丙戌甲午\n" +
    "丙子乙未\n" +
    "丙寅乙未\n" +
    "丙辰乙未\n" +
    "丙午乙未\n" +
    "丙申乙未\n" +
    "丙戌乙未\n" +
    "丙子丙申\n" +
    "丙寅丙申\n" +
    "丙辰丙申\n" +
    "丙午丙申\n" +
    "丙申丙申\n" +
    "丙戌丙申\n" +
    "丙子丁酉\n" +
    "丙寅丁酉\n" +
    "丙辰丁酉\n" +
    "丙午丁酉\n" +
    "丙申丁酉\n" +
    "丙戌丁酉\n" +
    "丙子戊戌\n" +
    "丙寅戊戌\n" +
    "丙辰戊戌\n" +
    "丙午戊戌\n" +
    "丙申戊戌\n" +
    "丙戌戊戌\n" +
    "丙子己亥\n" +
    "丙寅己亥\n" +
    "丙辰己亥\n" +
    "丙午己亥\n" +
    "丙申己亥\n" +
    "丙戌己亥\n" +
    "丁丑庚子\n" +
    "丁卯庚子\n" +
    "丁巳庚子\n" +
    "丁未庚子\n" +
    "丁酉庚子\n" +
    "丁亥庚子\n" +
    "丁丑辛丑\n" +
    "丁卯辛丑\n" +
    "丁巳辛丑\n" +
    "丁未辛丑\n" +
    "丁酉辛丑\n" +
    "丁亥辛丑\n" +
    "丁丑壬寅\n" +
    "丁卯壬寅\n" +
    "丁巳壬寅\n" +
    "丁未壬寅\n" +
    "丁酉壬寅\n" +
    "丁亥壬寅\n" +
    "丁丑癸卯\n" +
    "丁卯癸卯\n" +
    "丁巳癸卯\n" +
    "丁未癸卯\n" +
    "丁酉癸卯\n" +
    "丁亥癸卯\n" +
    "丁丑甲辰\n" +
    "丁卯甲辰\n" +
    "丁巳甲辰\n" +
    "丁未甲辰\n" +
    "丁酉甲辰\n" +
    "丁亥甲辰\n" +
    "丁丑乙巳\n" +
    "丁卯乙巳\n" +
    "丁巳乙巳\n" +
    "丁未乙巳\n" +
    "丁酉乙巳\n" +
    "丁亥乙巳\n" +
    "丁丑丙午\n" +
    "丁卯丙午\n" +
    "丁巳丙午\n" +
    "丁未丙午\n" +
    "丁酉丙午\n" +
    "丁亥丙午\n" +
    "丁丑丁未\n" +
    "丁卯丁未\n" +
    "丁巳丁未\n" +
    "丁未丁未\n" +
    "丁酉丁未\n" +
    "丁亥丁未\n" +
    "丁丑戊申\n" +
    "丁卯戊申\n" +
    "丁巳戊申\n" +
    "丁未戊申\n" +
    "丁酉戊申\n" +
    "丁亥戊申\n" +
    "丁丑己酉\n" +
    "丁卯己酉\n" +
    "丁巳己酉\n" +
    "丁未己酉\n" +
    "丁酉己酉\n" +
    "丁亥己酉\n" +
    "丁丑庚戌\n" +
    "丁卯庚戌\n" +
    "丁巳庚戌\n" +
    "丁未庚戌\n" +
    "丁酉庚戌\n" +
    "丁亥庚戌\n" +
    "丁丑辛亥\n" +
    "丁卯辛亥\n" +
    "丁巳辛亥\n" +
    "丁未辛亥\n" +
    "丁酉辛亥\n" +
    "丁亥辛亥\n" +
    "戊子壬子\n" +
    "戊寅壬子\n" +
    "戊辰壬子\n" +
    "戊午壬子\n" +
    "戊申壬子\n" +
    "戊戌壬子\n" +
    "戊子癸丑\n" +
    "戊寅癸丑\n" +
    "戊辰癸丑\n" +
    "戊午癸丑\n" +
    "戊申癸丑\n" +
    "戊戌癸丑\n" +
    "戊子甲寅\n" +
    "戊寅甲寅\n" +
    "戊辰甲寅\n" +
    "戊午甲寅\n" +
    "戊申甲寅\n" +
    "戊戌甲寅\n" +
    "戊子乙卯\n" +
    "戊寅乙卯\n" +
    "戊辰乙卯\n" +
    "戊午乙卯\n" +
    "戊申乙卯\n" +
    "戊戌乙卯\n" +
    "戊子丙辰\n" +
    "戊寅丙辰\n" +
    "戊辰丙辰\n" +
    "戊午丙辰\n" +
    "戊申丙辰\n" +
    "戊戌丙辰\n" +
    "戊子丁巳\n" +
    "戊寅丁巳\n" +
    "戊辰丁巳\n" +
    "戊午丁巳\n" +
    "戊申丁巳\n" +
    "戊戌丁巳\n" +
    "戊子戊午\n" +
    "戊寅戊午\n" +
    "戊辰戊午\n" +
    "戊午戊午\n" +
    "戊申戊午\n" +
    "戊戌戊午\n" +
    "戊子己未\n" +
    "戊寅己未\n" +
    "戊辰己未\n" +
    "戊午己未\n" +
    "戊申己未\n" +
    "戊戌己未\n" +
    "戊子庚申\n" +
    "戊寅庚申\n" +
    "戊辰庚申\n" +
    "戊午庚申\n" +
    "戊申庚申\n" +
    "戊戌庚申\n" +
    "戊子辛酉\n" +
    "戊寅辛酉\n" +
    "戊辰辛酉\n" +
    "戊午辛酉\n" +
    "戊申辛酉\n" +
    "戊戌辛酉\n" +
    "戊子壬戌\n" +
    "戊寅壬戌\n" +
    "戊辰壬戌\n" +
    "戊午壬戌\n" +
    "戊申壬戌\n" +
    "戊戌壬戌\n" +
    "戊子癸亥\n" +
    "戊寅癸亥\n" +
    "戊辰癸亥\n" +
    "戊午癸亥\n" +
    "戊申癸亥\n" +
    "戊戌癸亥\n" +
    "己丑甲子\n" +
    "己卯甲子\n" +
    "己巳甲子\n" +
    "己未甲子\n" +
    "己酉甲子\n" +
    "己亥甲子\n" +
    "己丑乙丑\n" +
    "己卯乙丑\n" +
    "己巳乙丑\n" +
    "己未乙丑\n" +
    "己酉乙丑\n" +
    "己亥乙丑\n" +
    "己丑丙寅\n" +
    "己卯丙寅\n" +
    "己巳丙寅\n" +
    "己未丙寅\n" +
    "己酉丙寅\n" +
    "己亥丙寅\n" +
    "己丑丁卯\n" +
    "己卯丁卯\n" +
    "己巳丁卯\n" +
    "己未丁卯\n" +
    "己酉丁卯\n" +
    "己亥丁卯\n" +
    "己丑戊辰\n" +
    "己卯戊辰\n" +
    "己巳戊辰\n" +
    "己未戊辰\n" +
    "己酉戊辰\n" +
    "己亥戊辰\n" +
    "己丑己巳\n" +
    "己卯己巳\n" +
    "己巳己巳\n" +
    "己未己巳\n" +
    "己酉己巳\n" +
    "己亥己巳\n" +
    "己丑庚午\n" +
    "己卯庚午\n" +
    "己巳庚午\n" +
    "己未庚午\n" +
    "己酉庚午\n" +
    "己亥庚午\n" +
    "己丑辛未\n" +
    "己卯辛未\n" +
    "己巳辛未\n" +
    "己未辛未\n" +
    "己酉辛未\n" +
    "己亥辛未\n" +
    "己丑壬申\n" +
    "己卯壬申\n" +
    "己巳壬申\n" +
    "己未壬申\n" +
    "己酉壬申\n" +
    "己亥壬申\n" +
    "己丑癸酉\n" +
    "己卯癸酉\n" +
    "己巳癸酉\n" +
    "己未癸酉\n" +
    "己酉癸酉\n" +
    "己亥癸酉\n" +
    "己丑甲戌\n" +
    "己卯甲戌\n" +
    "己巳甲戌\n" +
    "己未甲戌\n" +
    "己酉甲戌\n" +
    "己亥甲戌\n" +
    "己丑乙亥\n" +
    "己卯乙亥\n" +
    "己巳乙亥\n" +
    "己未乙亥\n" +
    "己酉乙亥\n" +
    "己亥乙亥\n" +
    "庚子丙子\n" +
    "庚寅丙子\n" +
    "庚辰丙子\n" +
    "庚午丙子\n" +
    "庚申丙子\n" +
    "庚戌丙子\n" +
    "庚子丁丑\n" +
    "庚寅丁丑\n" +
    "庚辰丁丑\n" +
    "庚午丁丑\n" +
    "庚申丁丑\n" +
    "庚戌丁丑\n" +
    "庚子戊寅\n" +
    "庚寅戊寅\n" +
    "庚辰戊寅\n" +
    "庚午戊寅\n" +
    "庚申戊寅\n" +
    "庚戌戊寅\n" +
    "庚子己卯\n" +
    "庚寅己卯\n" +
    "庚辰己卯\n" +
    "庚午己卯\n" +
    "庚申己卯\n" +
    "庚戌己卯\n" +
    "庚子庚辰\n" +
    "庚寅庚辰\n" +
    "庚辰庚辰\n" +
    "庚午庚辰\n" +
    "庚申庚辰\n" +
    "庚戌庚辰\n" +
    "庚子辛巳\n" +
    "庚寅辛巳\n" +
    "庚辰辛巳\n" +
    "庚午辛巳\n" +
    "庚申辛巳\n" +
    "庚戌辛巳\n" +
    "庚子壬午\n" +
    "庚寅壬午\n" +
    "庚辰壬午\n" +
    "庚午壬午\n" +
    "庚申壬午\n" +
    "庚戌壬午\n" +
    "庚子癸未\n" +
    "庚寅癸未\n" +
    "庚辰癸未\n" +
    "庚午癸未\n" +
    "庚申癸未\n" +
    "庚戌癸未\n" +
    "庚子甲申\n" +
    "庚寅甲申\n" +
    "庚辰甲申\n" +
    "庚午甲申\n" +
    "庚申甲申\n" +
    "庚戌甲申\n" +
    "庚子乙酉\n" +
    "庚寅乙酉\n" +
    "庚辰乙酉\n" +
    "庚午乙酉\n" +
    "庚申乙酉\n" +
    "庚戌乙酉\n" +
    "庚子丙戌\n" +
    "庚寅丙戌\n" +
    "庚辰丙戌\n" +
    "庚午丙戌\n" +
    "庚申丙戌\n" +
    "庚戌丙戌\n" +
    "庚子丁亥\n" +
    "庚寅丁亥\n" +
    "庚辰丁亥\n" +
    "庚午丁亥\n" +
    "庚申丁亥\n" +
    "庚戌丁亥\n" +
    "辛丑戊子\n" +
    "辛卯戊子\n" +
    "辛巳戊子\n" +
    "辛未戊子\n" +
    "辛酉戊子\n" +
    "辛亥戊子\n" +
    "辛丑己丑\n" +
    "辛卯己丑\n" +
    "辛巳己丑\n" +
    "辛未己丑\n" +
    "辛酉己丑\n" +
    "辛亥己丑\n" +
    "辛丑庚寅\n" +
    "辛卯庚寅\n" +
    "辛巳庚寅\n" +
    "辛未庚寅\n" +
    "辛酉庚寅\n" +
    "辛亥庚寅\n" +
    "辛丑辛卯\n" +
    "辛卯辛卯\n" +
    "辛巳辛卯\n" +
    "辛未辛卯\n" +
    "辛酉辛卯\n" +
    "辛亥辛卯\n" +
    "辛丑壬辰\n" +
    "辛卯壬辰\n" +
    "辛巳壬辰\n" +
    "辛未壬辰\n" +
    "辛酉壬辰\n" +
    "辛亥壬辰\n" +
    "辛丑癸巳\n" +
    "辛卯癸巳\n" +
    "辛巳癸巳\n" +
    "辛未癸巳\n" +
    "辛酉癸巳\n" +
    "辛亥癸巳\n" +
    "辛丑甲午\n" +
    "辛卯甲午\n" +
    "辛巳甲午\n" +
    "辛未甲午\n" +
    "辛酉甲午\n" +
    "辛亥甲午\n" +
    "辛丑乙未\n" +
    "辛卯乙未\n" +
    "辛巳乙未\n" +
    "辛未乙未\n" +
    "辛酉乙未\n" +
    "辛亥乙未\n" +
    "辛丑丙申\n" +
    "辛卯丙申\n" +
    "辛巳丙申\n" +
    "辛未丙申\n" +
    "辛酉丙申\n" +
    "辛亥丙申\n" +
    "辛丑丁酉\n" +
    "辛卯丁酉\n" +
    "辛巳丁酉\n" +
    "辛未丁酉\n" +
    "辛酉丁酉\n" +
    "辛亥丁酉\n" +
    "辛丑戊戌\n" +
    "辛卯戊戌\n" +
    "辛巳戊戌\n" +
    "辛未戊戌\n" +
    "辛酉戊戌\n" +
    "辛亥戊戌\n" +
    "辛丑己亥\n" +
    "辛卯己亥\n" +
    "辛巳己亥\n" +
    "辛未己亥\n" +
    "辛酉己亥\n" +
    "辛亥己亥\n" +
    "壬子庚子\n" +
    "壬寅庚子\n" +
    "壬辰庚子\n" +
    "壬午庚子\n" +
    "壬申庚子\n" +
    "壬戌庚子\n" +
    "壬子辛丑\n" +
    "壬寅辛丑\n" +
    "壬辰辛丑\n" +
    "壬午辛丑\n" +
    "壬申辛丑\n" +
    "壬戌辛丑\n" +
    "壬子壬寅\n" +
    "壬寅壬寅\n" +
    "壬辰壬寅\n" +
    "壬午壬寅\n" +
    "壬申壬寅\n" +
    "壬戌壬寅\n" +
    "壬子癸卯\n" +
    "壬寅癸卯\n" +
    "壬辰癸卯\n" +
    "壬午癸卯\n" +
    "壬申癸卯\n" +
    "壬戌癸卯\n" +
    "壬子甲辰\n" +
    "壬寅甲辰\n" +
    "壬辰甲辰\n" +
    "壬午甲辰\n" +
    "壬申甲辰\n" +
    "壬戌甲辰\n" +
    "壬子乙巳\n" +
    "壬寅乙巳\n" +
    "壬辰乙巳\n" +
    "壬午乙巳\n" +
    "壬申乙巳\n" +
    "壬戌乙巳\n" +
    "壬子丙午\n" +
    "壬寅丙午\n" +
    "壬辰丙午\n" +
    "壬午丙午\n" +
    "壬申丙午\n" +
    "壬戌丙午\n" +
    "壬子丁未\n" +
    "壬寅丁未\n" +
    "壬辰丁未\n" +
    "壬午丁未\n" +
    "壬申丁未\n" +
    "壬戌丁未\n" +
    "壬子戊申\n" +
    "壬寅戊申\n" +
    "壬辰戊申\n" +
    "壬午戊申\n" +
    "壬申戊申\n" +
    "壬戌戊申\n" +
    "壬子己酉\n" +
    "壬寅己酉\n" +
    "壬辰己酉\n" +
    "壬午己酉\n" +
    "壬申己酉\n" +
    "壬戌己酉\n" +
    "壬子庚戌\n" +
    "壬寅庚戌\n" +
    "壬辰庚戌\n" +
    "壬午庚戌\n" +
    "壬申庚戌\n" +
    "壬戌庚戌\n" +
    "壬子辛亥\n" +
    "壬寅辛亥\n" +
    "壬辰辛亥\n" +
    "壬午辛亥\n" +
    "壬申辛亥\n" +
    "壬戌辛亥\n" +
    "癸丑壬子\n" +
    "癸卯壬子\n" +
    "癸巳壬子\n" +
    "癸未壬子\n" +
    "癸酉壬子\n" +
    "癸亥壬子\n" +
    "癸丑癸丑\n" +
    "癸卯癸丑\n" +
    "癸巳癸丑\n" +
    "癸未癸丑\n" +
    "癸酉癸丑\n" +
    "癸亥癸丑\n" +
    "癸丑甲寅\n" +
    "癸卯甲寅\n" +
    "癸巳甲寅\n" +
    "癸未甲寅\n" +
    "癸酉甲寅\n" +
    "癸亥甲寅\n" +
    "癸丑乙卯\n" +
    "癸卯乙卯\n" +
    "癸巳乙卯\n" +
    "癸未乙卯\n" +
    "癸酉乙卯\n" +
    "癸亥乙卯\n" +
    "癸丑丙辰\n" +
    "癸卯丙辰\n" +
    "癸巳丙辰\n" +
    "癸未丙辰\n" +
    "癸酉丙辰\n" +
    "癸亥丙辰\n" +
    "癸丑丁巳\n" +
    "癸卯丁巳\n" +
    "癸巳丁巳\n" +
    "癸未丁巳\n" +
    "癸酉丁巳\n" +
    "癸亥丁巳\n" +
    "癸丑戊午\n" +
    "癸卯戊午\n" +
    "癸巳戊午\n" +
    "癸未戊午\n" +
    "癸酉戊午\n" +
    "癸亥戊午\n" +
    "癸丑己未\n" +
    "癸卯己未\n" +
    "癸巳己未\n" +
    "癸未己未\n" +
    "癸酉己未\n" +
    "癸亥己未\n" +
    "癸丑庚申\n" +
    "癸卯庚申\n" +
    "癸巳庚申\n" +
    "癸未庚申\n" +
    "癸酉庚申\n" +
    "癸亥庚申\n" +
    "癸丑辛酉\n" +
    "癸卯辛酉\n" +
    "癸巳辛酉\n" +
    "癸未辛酉\n" +
    "癸酉辛酉\n" +
    "癸亥辛酉\n" +
    "癸丑壬戌\n" +
    "癸卯壬戌\n" +
    "癸巳壬戌\n" +
    "癸未壬戌\n" +
    "癸酉壬戌\n" +
    "癸亥壬戌\n" +
    "癸丑癸亥\n" +
    "癸卯癸亥\n" +
    "癸巳癸亥\n" +
    "癸未癸亥\n" +
    "癸酉癸亥\n" +
    "癸亥癸亥";
    let arr = indexStr.split("\n")
    let ret = -1;
    let gzStr = bz[4] + bz[5] + bz[6] + bz[7];
    for (let i = 0; i < arr.length; i++) {
        const item = arr[i];
        if (item == gzStr) {
            ret = i + 1;
            break
        }
    }
    return ret;
}

function getIndex3_2(bz) {
    let arr = ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"];
    let ret = -1;
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] == bz[4]) {
            ret = i + 1;
            break;
        }
    }
    return ret;
}

function getIndex3_3(bz) {
    let data = "甲子\n" +
            "乙子\n" +
            "丙子\n" +
            "丁子\n" +
            "戊子\n" +
            "己子\n" +
            "庚子\n" +
            "辛子\n" +
            "壬子\n" +
            "癸子\n" +
            "甲丑\n" +
            "乙丑\n" +
            "丙丑\n" +
            "丁丑\n" +
            "戊丑\n" +
            "己丑\n" +
            "庚丑\n" +
            "辛丑\n" +
            "壬丑\n" +
            "癸丑\n" +
            "甲寅\n" +
            "乙寅\n" +
            "丙寅\n" +
            "丁寅\n" +
            "戊寅\n" +
            "己寅\n" +
            "庚寅\n" +
            "辛寅\n" +
            "壬寅\n" +
            "癸寅\n" +
            "甲卯\n" +
            "乙卯\n" +
            "丙卯\n" +
            "丁卯\n" +
            "戊卯\n" +
            "己卯\n" +
            "庚卯\n" +
            "辛卯\n" +
            "壬卯\n" +
            "癸卯\n" +
            "甲辰\n" +
            "乙辰\n" +
            "丙辰\n" +
            "丁辰\n" +
            "戊辰\n" +
            "己辰\n" +
            "庚辰\n" +
            "辛辰\n" +
            "壬辰\n" +
            "癸辰\n" +
            "甲巳\n" +
            "乙巳\n" +
            "丙巳\n" +
            "丁巳\n" +
            "戊巳\n" +
            "己巳\n" +
            "庚巳\n" +
            "辛巳\n" +
            "壬巳\n" +
            "癸巳\n" +
            "甲午\n" +
            "乙午\n" +
            "丙午\n" +
            "丁午\n" +
            "戊午\n" +
            "己午\n" +
            "庚午\n" +
            "辛午\n" +
            "壬午\n" +
            "癸午\n" +
            "甲未\n" +
            "乙未\n" +
            "丙未\n" +
            "丁未\n" +
            "戊未\n" +
            "己未\n" +
            "庚未\n" +
            "辛未\n" +
            "壬未\n" +
            "癸未\n" +
            "甲申\n" +
            "乙申\n" +
            "丙申\n" +
            "丁申\n" +
            "戊申\n" +
            "己申\n" +
            "庚申\n" +
            "辛申\n" +
            "壬申\n" +
            "癸申\n" +
            "甲酉\n" +
            "乙酉\n" +
            "丙酉\n" +
            "丁酉\n" +
            "戊酉\n" +
            "己酉\n" +
            "庚酉\n" +
            "辛酉\n" +
            "壬酉\n" +
            "癸酉\n" +
            "甲戌\n" +
            "乙戌\n" +
            "丙戌\n" +
            "丁戌\n" +
            "戊戌\n" +
            "己戌\n" +
            "庚戌\n" +
            "辛戌\n" +
            "壬戌\n" +
            "癸戌\n" +
            "甲亥\n" +
            "乙亥\n" +
            "丙亥\n" +
            "丁亥\n" +
            "庚亥\n" +
            "辛亥\n" +
            "壬亥\n" +
            "癸亥";
    let ret = -1;
    let arr = data.split("\n");
    //日柱，时柱
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] == bz[4] + bz[3]) {
            ret = i + 1;
            break;
        }
    }
    return ret;
}

function getIndex3_4(bz) {
    let data = "木寅\n" +
            "木卯\n" +
            "木辰\n" +
            "木巳\n" +
            "木午\n" +
            "木未\n" +
            "木申\n" +
            "木酉\n" +
            "木戌\n" +
            "木亥\n" +
            "木子\n" +
            "木丑\n" +
            "火寅\n" +
            "火卯\n" +
            "火辰\n" +
            "火巳\n" +
            "火午\n" +
            "火未\n" +
            "火申\n" +
            "火酉\n" +
            "火戌\n" +
            "火亥\n" +
            "火子\n" +
            "火丑\n" +
            "土寅\n" +
            "土卯\n" +
            "土辰\n" +
            "土巳\n" +
            "土午\n" +
            "土未\n" +
            "土申\n" +
            "土酉\n" +
            "土戌\n" +
            "土亥\n" +
            "土子\n" +
            "土丑\n" +
            "金寅\n" +
            "金卯\n" +
            "金辰\n" +
            "金巳\n" +
            "金午\n" +
            "金未\n" +
            "金申\n" +
            "金酉\n" +
            "金戌\n" +
            "金亥\n" +
            "金子\n" +
            "金丑\n" +
            "水寅\n" +
            "水卯\n" +
            "水辰\n" +
            "水巳\n" +
            "水午\n" +
            "水未\n" +
            "水申\n" +
            "水酉\n" +
            "水戌\n" +
            "水亥\n" +
            "水子\n" +
            "水丑";
    let ret = -1;
    let arr = data.split("\n");
    //日柱，时柱
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] == wxForBz(bz[4]) + bz[3]) {
            ret = i + 1;
            break;
        }
    }
    return ret;
}

function getIndex4_1(bz) {
    let data = "寅甲甲子\n" +
            "寅甲乙丑\n" +
            "寅甲丙寅\n" +
            "寅甲丁卯\n" +
            "寅甲戊辰\n" +
            "寅甲己巳\n" +
            "寅甲庚午\n" +
            "寅甲辛未\n" +
            "寅甲壬申\n" +
            "寅甲癸酉\n" +
            "寅甲甲戌\n" +
            "寅甲乙亥\n" +
            "寅乙丙子\n" +
            "寅乙丁丑\n" +
            "寅乙戊寅\n" +
            "寅乙己卯\n" +
            "寅乙庚辰\n" +
            "寅乙辛巳\n" +
            "寅乙壬午\n" +
            "寅乙癸未\n" +
            "寅乙甲申\n" +
            "寅乙乙酉\n" +
            "寅乙丙戌\n" +
            "寅乙丁亥\n" +
            "寅丙戊子\n" +
            "寅丙己丑\n" +
            "寅丙庚寅\n" +
            "寅丙辛卯\n" +
            "寅丙壬辰\n" +
            "寅丙癸巳\n" +
            "寅丙甲午\n" +
            "寅丙乙未\n" +
            "寅丙丙申\n" +
            "寅丙丁酉\n" +
            "寅丙戊戌\n" +
            "寅丙己亥\n" +
            "寅丁庚子\n" +
            "寅丁辛丑\n" +
            "寅丁壬寅\n" +
            "寅丁癸卯\n" +
            "寅丁甲辰\n" +
            "寅丁乙巳\n" +
            "寅丁丙午\n" +
            "寅丁丁未\n" +
            "寅丁戊申\n" +
            "寅丁己酉\n" +
            "寅丁庚戌\n" +
            "寅丁辛亥\n" +
            "寅戊壬子\n" +
            "寅戊癸丑\n" +
            "寅戊甲寅\n" +
            "寅戊乙卯\n" +
            "寅戊丙辰\n" +
            "寅戊丁巳\n" +
            "寅戊戊午\n" +
            "寅戊己未\n" +
            "寅戊庚申\n" +
            "寅戊辛酉\n" +
            "寅戊壬戌\n" +
            "寅戊癸亥\n" +
            "寅己甲子\n" +
            "寅己乙丑\n" +
            "寅己丙寅\n" +
            "寅己丁卯\n" +
            "寅己戊辰\n" +
            "寅己己巳\n" +
            "寅己庚午\n" +
            "寅己辛未\n" +
            "寅己壬申\n" +
            "寅己癸酉\n" +
            "寅己甲戌\n" +
            "寅己乙亥\n" +
            "寅庚丙子\n" +
            "寅庚丁丑\n" +
            "寅庚戊寅\n" +
            "寅庚己卯\n" +
            "寅庚庚辰\n" +
            "寅庚辛巳\n" +
            "寅庚壬午\n" +
            "寅庚癸未\n" +
            "寅庚甲申\n" +
            "寅庚乙酉\n" +
            "寅庚丙戌\n" +
            "寅庚丁亥\n" +
            "寅辛戊子\n" +
            "寅辛己丑\n" +
            "寅辛庚寅\n" +
            "寅辛辛卯\n" +
            "寅辛壬辰\n" +
            "寅辛癸巳\n" +
            "寅辛甲午\n" +
            "寅辛乙未\n" +
            "寅辛丙申\n" +
            "寅辛丁酉\n" +
            "寅辛戊戌\n" +
            "寅辛己亥\n" +
            "寅壬庚子\n" +
            "寅壬辛丑\n" +
            "寅壬壬寅\n" +
            "寅壬癸卯\n" +
            "寅壬甲辰\n" +
            "寅壬乙巳\n" +
            "寅壬丙午\n" +
            "寅壬丁未\n" +
            "寅壬戊申\n" +
            "寅壬己酉\n" +
            "寅壬庚戌\n" +
            "寅壬辛亥\n" +
            "寅癸壬子\n" +
            "寅癸癸丑\n" +
            "寅癸甲寅\n" +
            "寅癸乙卯\n" +
            "寅癸丙辰\n" +
            "寅癸丁巳\n" +
            "寅癸戊午\n" +
            "寅癸己未\n" +
            "寅癸庚申\n" +
            "寅癸辛酉\n" +
            "寅癸壬戌\n" +
            "寅癸癸亥\n" +
            "卯甲甲子\n" +
            "卯甲乙丑\n" +
            "卯甲丙寅\n" +
            "卯甲丁卯\n" +
            "卯甲戊辰\n" +
            "卯甲己巳\n" +
            "卯甲庚午\n" +
            "卯甲辛未\n" +
            "卯甲壬申\n" +
            "卯甲癸酉\n" +
            "卯甲甲戌\n" +
            "卯甲乙亥\n" +
            "卯乙丙子\n" +
            "卯乙丁丑\n" +
            "卯乙戊寅\n" +
            "卯乙己卯\n" +
            "卯乙庚辰\n" +
            "卯乙辛巳\n" +
            "卯乙壬午\n" +
            "卯乙癸未\n" +
            "卯乙甲申\n" +
            "卯乙乙酉\n" +
            "卯乙丙戌\n" +
            "卯乙丁亥\n" +
            "卯丙戊子\n" +
            "卯丙己丑\n" +
            "卯丙庚寅\n" +
            "卯丙辛卯\n" +
            "卯丙壬辰\n" +
            "卯丙癸巳\n" +
            "卯丙甲午\n" +
            "卯丙乙未\n" +
            "卯丙丙申\n" +
            "卯丙丁酉\n" +
            "卯丙戊戌\n" +
            "卯丙己亥\n" +
            "卯丁庚子\n" +
            "卯丁辛丑\n" +
            "卯丁壬寅\n" +
            "卯丁癸卯\n" +
            "卯丁甲辰\n" +
            "卯丁乙巳\n" +
            "卯丁丙午\n" +
            "卯丁丁未\n" +
            "卯丁戊申\n" +
            "卯丁己酉\n" +
            "卯丁庚戌\n" +
            "卯丁辛亥\n" +
            "卯戊壬子\n" +
            "卯戊癸丑\n" +
            "卯戊甲寅\n" +
            "卯戊乙卯\n" +
            "卯戊丙辰\n" +
            "卯戊丁巳\n" +
            "卯戊戊午\n" +
            "卯戊己未\n" +
            "卯戊庚申\n" +
            "卯戊辛酉\n" +
            "卯戊壬戌\n" +
            "卯戊癸亥\n" +
            "卯己甲子\n" +
            "卯己乙丑\n" +
            "卯己丙寅\n" +
            "卯己丁卯\n" +
            "卯己戊辰\n" +
            "卯己己巳\n" +
            "卯己庚午\n" +
            "卯己辛未\n" +
            "卯己壬申\n" +
            "卯己癸酉\n" +
            "卯己甲戌\n" +
            "卯己乙亥\n" +
            "卯庚丙子\n" +
            "卯庚丁丑\n" +
            "卯庚戊寅\n" +
            "卯庚己卯\n" +
            "卯庚庚辰\n" +
            "卯庚辛巳\n" +
            "卯庚壬午\n" +
            "卯庚癸未\n" +
            "卯庚甲申\n" +
            "卯庚乙酉\n" +
            "卯庚丙戌\n" +
            "卯庚丁亥\n" +
            "卯辛戊子\n" +
            "卯辛己丑\n" +
            "卯辛庚寅\n" +
            "卯辛辛卯\n" +
            "卯辛壬辰\n" +
            "卯辛癸巳\n" +
            "卯辛甲午\n" +
            "卯辛乙未\n" +
            "卯辛丙申\n" +
            "卯辛丁酉\n" +
            "卯辛戊戌\n" +
            "卯辛己亥\n" +
            "卯壬庚子\n" +
            "卯壬辛丑\n" +
            "卯壬壬寅\n" +
            "卯壬癸卯\n" +
            "卯壬甲辰\n" +
            "卯壬乙巳\n" +
            "卯壬丙午\n" +
            "卯壬丁未\n" +
            "卯壬戊申\n" +
            "卯壬己酉\n" +
            "卯壬庚戌\n" +
            "卯壬辛亥\n" +
            "卯癸壬子\n" +
            "卯癸癸丑\n" +
            "卯癸甲寅\n" +
            "卯癸乙卯\n" +
            "卯癸丙辰\n" +
            "卯癸丁巳\n" +
            "卯癸戊午\n" +
            "卯癸己未\n" +
            "卯癸庚申\n" +
            "卯癸辛酉\n" +
            "卯癸壬戌\n" +
            "卯癸癸亥\n" +
            "辰甲甲子\n" +
            "辰甲乙丑\n" +
            "辰甲丙寅\n" +
            "辰甲丁卯\n" +
            "辰甲戊辰\n" +
            "辰甲己巳\n" +
            "辰甲庚午\n" +
            "辰甲辛未\n" +
            "辰甲壬申\n" +
            "辰甲癸酉\n" +
            "辰甲甲戌\n" +
            "辰甲乙亥\n" +
            "辰乙丙子\n" +
            "辰乙丁丑\n" +
            "辰乙戊寅\n" +
            "辰乙己卯\n" +
            "辰乙庚辰\n" +
            "辰乙辛巳\n" +
            "辰乙壬午\n" +
            "辰乙癸未\n" +
            "辰乙甲申\n" +
            "辰乙乙酉\n" +
            "辰乙丙戌\n" +
            "辰乙丁亥\n" +
            "辰丙戊子\n" +
            "辰丙己丑\n" +
            "辰丙庚寅\n" +
            "辰丙辛卯\n" +
            "辰丙壬辰\n" +
            "辰丙癸巳\n" +
            "辰丙甲午\n" +
            "辰丙乙未\n" +
            "辰丙丙申\n" +
            "辰丙丁酉\n" +
            "辰丙戊戌\n" +
            "辰丙己亥\n" +
            "辰丁庚子\n" +
            "辰丁辛丑\n" +
            "辰丁壬寅\n" +
            "辰丁癸卯\n" +
            "辰丁甲辰\n" +
            "辰丁乙巳\n" +
            "辰丁丙午\n" +
            "辰丁丁未\n" +
            "辰丁戊申\n" +
            "辰丁己酉\n" +
            "辰丁庚戌\n" +
            "辰丁辛亥\n" +
            "辰戊壬子\n" +
            "辰戊癸丑\n" +
            "辰戊甲寅\n" +
            "辰戊乙卯\n" +
            "辰戊丙辰\n" +
            "辰戊丁巳\n" +
            "辰戊戊午\n" +
            "辰戊己未\n" +
            "辰戊庚申\n" +
            "辰戊辛酉\n" +
            "辰戊壬戌\n" +
            "辰戊癸亥\n" +
            "辰己甲子\n" +
            "辰己乙丑\n" +
            "辰己丙寅\n" +
            "辰己丁卯\n" +
            "辰己戊辰\n" +
            "辰己己巳\n" +
            "辰己庚午\n" +
            "辰己辛未\n" +
            "辰己壬申\n" +
            "辰己癸酉\n" +
            "辰己甲戌\n" +
            "辰己乙亥\n" +
            "辰庚丙子\n" +
            "辰庚丁丑\n" +
            "辰庚戊寅\n" +
            "辰庚己卯\n" +
            "辰庚庚辰\n" +
            "辰庚辛巳\n" +
            "辰庚壬午\n" +
            "辰庚癸未\n" +
            "辰庚甲申\n" +
            "辰庚乙酉\n" +
            "辰庚丙戌\n" +
            "辰庚丁亥\n" +
            "辰辛戊子\n" +
            "辰辛己丑\n" +
            "辰辛庚寅\n" +
            "辰辛辛卯\n" +
            "辰辛壬辰\n" +
            "辰辛癸巳\n" +
            "辰辛甲午\n" +
            "辰辛乙未\n" +
            "辰辛丙申\n" +
            "辰辛丁酉\n" +
            "辰辛戊戌\n" +
            "辰辛己亥\n" +
            "辰壬庚子\n" +
            "辰壬辛丑\n" +
            "辰壬壬寅\n" +
            "辰壬癸卯\n" +
            "辰壬甲辰\n" +
            "辰壬乙巳\n" +
            "辰壬丙午\n" +
            "辰壬丁未\n" +
            "辰壬戊申\n" +
            "辰壬己酉\n" +
            "辰壬庚戌\n" +
            "辰壬辛亥\n" +
            "辰癸壬子\n" +
            "辰癸癸丑\n" +
            "辰癸甲寅\n" +
            "辰癸乙卯\n" +
            "辰癸丙辰\n" +
            "辰癸丁巳\n" +
            "辰癸戊午\n" +
            "辰癸己未\n" +
            "辰癸庚申\n" +
            "辰癸辛酉\n" +
            "辰癸壬戌\n" +
            "辰癸癸亥\n" +
            "巳甲甲子\n" +
            "巳甲乙丑\n" +
            "巳甲丙寅\n" +
            "巳甲丁卯\n" +
            "巳甲戊辰\n" +
            "巳甲己巳\n" +
            "巳甲庚午\n" +
            "巳甲辛未\n" +
            "巳甲壬申\n" +
            "巳甲癸酉\n" +
            "巳甲甲戌\n" +
            "巳甲乙亥\n" +
            "巳乙丙子\n" +
            "巳乙丁丑\n" +
            "巳乙戊寅\n" +
            "巳乙己卯\n" +
            "巳乙庚辰\n" +
            "巳乙辛巳\n" +
            "巳乙壬午\n" +
            "巳乙癸未\n" +
            "巳乙甲申\n" +
            "巳乙乙酉\n" +
            "巳乙丙戌\n" +
            "巳乙丁亥\n" +
            "巳丙戊子\n" +
            "巳丙己丑\n" +
            "巳丙庚寅\n" +
            "巳丙辛卯\n" +
            "巳丙壬辰\n" +
            "巳丙癸巳\n" +
            "巳丙甲午\n" +
            "巳丙乙未\n" +
            "巳丙丙申\n" +
            "巳丙丁酉\n" +
            "巳丙戊戌\n" +
            "巳丙己亥\n" +
            "巳丁庚子\n" +
            "巳丁辛丑\n" +
            "巳丁壬寅\n" +
            "巳丁癸卯\n" +
            "巳丁甲辰\n" +
            "巳丁乙巳\n" +
            "巳丁丙午\n" +
            "巳丁丁未\n" +
            "巳丁戊申\n" +
            "巳丁己酉\n" +
            "巳丁庚戌\n" +
            "巳丁辛亥\n" +
            "巳戊壬子\n" +
            "巳戊癸丑\n" +
            "巳戊甲寅\n" +
            "巳戊乙卯\n" +
            "巳戊丙辰\n" +
            "巳戊丁巳\n" +
            "巳戊戊午\n" +
            "巳戊己未\n" +
            "巳戊庚申\n" +
            "巳戊辛酉\n" +
            "巳戊壬戌\n" +
            "巳戊癸亥\n" +
            "巳己甲子\n" +
            "巳己乙丑\n" +
            "巳己丙寅\n" +
            "巳己丁卯\n" +
            "巳己戊辰\n" +
            "巳己己巳\n" +
            "巳己庚午\n" +
            "巳己辛未\n" +
            "巳己壬申\n" +
            "巳己癸酉\n" +
            "巳己甲戌\n" +
            "巳己乙亥\n" +
            "巳庚丙子\n" +
            "巳庚丁丑\n" +
            "巳庚戊寅\n" +
            "巳庚己卯\n" +
            "巳庚庚辰\n" +
            "巳庚辛巳\n" +
            "巳庚壬午\n" +
            "巳庚癸未\n" +
            "巳庚甲申\n" +
            "巳庚乙酉\n" +
            "巳庚丙戌\n" +
            "巳庚丁亥\n" +
            "巳辛戊子\n" +
            "巳辛己丑\n" +
            "巳辛庚寅\n" +
            "巳辛辛卯\n" +
            "巳辛壬辰\n" +
            "巳辛癸巳\n" +
            "巳辛甲午\n" +
            "巳辛乙未\n" +
            "巳辛丙申\n" +
            "巳辛丁酉\n" +
            "巳辛戊戌\n" +
            "巳辛己亥\n" +
            "巳壬庚子\n" +
            "巳壬辛丑\n" +
            "巳壬壬寅\n" +
            "巳壬癸卯\n" +
            "巳壬甲辰\n" +
            "巳壬乙巳\n" +
            "巳壬丙午\n" +
            "巳壬丁未\n" +
            "巳壬戊申\n" +
            "巳壬己酉\n" +
            "巳壬庚戌\n" +
            "巳壬辛亥\n" +
            "巳癸壬子\n" +
            "巳癸癸丑\n" +
            "巳癸甲寅\n" +
            "巳癸乙卯\n" +
            "巳癸丙辰\n" +
            "巳癸丁巳\n" +
            "巳癸戊午\n" +
            "巳癸己未\n" +
            "巳癸庚申\n" +
            "巳癸辛酉\n" +
            "巳癸壬戌\n" +
            "巳癸癸亥\n" +
            "午甲甲子\n" +
            "午甲乙丑\n" +
            "午甲丙寅\n" +
            "午甲丁卯\n" +
            "午甲戊辰\n" +
            "午甲己巳\n" +
            "午甲庚午\n" +
            "午甲辛未\n" +
            "午甲壬申\n" +
            "午甲癸酉\n" +
            "午甲甲戌\n" +
            "午甲乙亥\n" +
            "午乙丙子\n" +
            "午乙丁丑\n" +
            "午乙戊寅\n" +
            "午乙己卯\n" +
            "午乙庚辰\n" +
            "午乙辛巳\n" +
            "午乙壬午\n" +
            "午乙癸未\n" +
            "午乙甲申\n" +
            "午乙乙酉\n" +
            "午乙丙戌\n" +
            "午乙丁亥\n" +
            "午丙戊子\n" +
            "午丙己丑\n" +
            "午丙庚寅\n" +
            "午丙辛卯\n" +
            "午丙壬辰\n" +
            "午丙癸巳\n" +
            "午丙甲午\n" +
            "午丙乙未\n" +
            "午丙丙申\n" +
            "午丙丁酉\n" +
            "午丙戊戌\n" +
            "午丙己亥\n" +
            "午丁庚子\n" +
            "午丁辛丑\n" +
            "午丁壬寅\n" +
            "午丁癸卯\n" +
            "午丁甲辰\n" +
            "午丁乙巳\n" +
            "午丁丙午\n" +
            "午丁丁未\n" +
            "午丁戊申\n" +
            "午丁己酉\n" +
            "午丁庚戌\n" +
            "午丁辛亥\n" +
            "午戊壬子\n" +
            "午戊癸丑\n" +
            "午戊甲寅\n" +
            "午戊乙卯\n" +
            "午戊丙辰\n" +
            "午戊丁巳\n" +
            "午戊戊午\n" +
            "午戊己未\n" +
            "午戊庚申\n" +
            "午戊辛酉\n" +
            "午戊壬戌\n" +
            "午戊癸亥\n" +
            "午己甲子\n" +
            "午己乙丑\n" +
            "午己丙寅\n" +
            "午己丁卯\n" +
            "午己戊辰\n" +
            "午己己巳\n" +
            "午己庚午\n" +
            "午己辛未\n" +
            "午己壬申\n" +
            "午己癸酉\n" +
            "午己甲戌\n" +
            "午己乙亥\n" +
            "午庚丙子\n" +
            "午庚丁丑\n" +
            "午庚戊寅\n" +
            "午庚己卯\n" +
            "午庚庚辰\n" +
            "午庚辛巳\n" +
            "午庚壬午\n" +
            "午庚癸未\n" +
            "午庚甲申\n" +
            "午庚乙酉\n" +
            "午庚丙戌\n" +
            "午庚丁亥\n" +
            "午辛戊子\n" +
            "午辛己丑\n" +
            "午辛庚寅\n" +
            "午辛辛卯\n" +
            "午辛壬辰\n" +
            "午辛癸巳\n" +
            "午辛甲午\n" +
            "午辛乙未\n" +
            "午辛丙申\n" +
            "午辛丁酉\n" +
            "午辛戊戌\n" +
            "午辛己亥\n" +
            "午壬庚子\n" +
            "午壬辛丑\n" +
            "午壬壬寅\n" +
            "午壬癸卯\n" +
            "午壬甲辰\n" +
            "午壬乙巳\n" +
            "午壬丙午\n" +
            "午壬丁未\n" +
            "午壬戊申\n" +
            "午壬己酉\n" +
            "午壬庚戌\n" +
            "午壬辛亥\n" +
            "午癸壬子\n" +
            "午癸癸丑\n" +
            "午癸甲寅\n" +
            "午癸乙卯\n" +
            "午癸丙辰\n" +
            "午癸丁巳\n" +
            "午癸戊午\n" +
            "午癸己未\n" +
            "午癸庚申\n" +
            "午癸辛酉\n" +
            "午癸壬戌\n" +
            "午癸癸亥\n" +
            "未甲甲子\n" +
            "未甲乙丑\n" +
            "未甲丙寅\n" +
            "未甲丁卯\n" +
            "未甲戊辰\n" +
            "未甲己巳\n" +
            "未甲庚午\n" +
            "未甲辛未\n" +
            "未甲壬申\n" +
            "未甲癸酉\n" +
            "未甲甲戌\n" +
            "未甲乙亥\n" +
            "未乙丙子\n" +
            "未乙丁丑\n" +
            "未乙戊寅\n" +
            "未乙己卯\n" +
            "未乙庚辰\n" +
            "未乙辛巳\n" +
            "未乙壬午\n" +
            "未乙癸未\n" +
            "未乙甲申\n" +
            "未乙乙酉\n" +
            "未乙丙戌\n" +
            "未乙丁亥\n" +
            "未丙戊子\n" +
            "未丙己丑\n" +
            "未丙庚寅\n" +
            "未丙辛卯\n" +
            "未丙壬辰\n" +
            "未丙癸巳\n" +
            "未丙甲午\n" +
            "未丙乙未\n" +
            "未丙丙申\n" +
            "未丙丁酉\n" +
            "未丙戊戌\n" +
            "未丙己亥\n" +
            "未丁庚子\n" +
            "未丁辛丑\n" +
            "未丁壬寅\n" +
            "未丁癸卯\n" +
            "未丁甲辰\n" +
            "未丁乙巳\n" +
            "未丁丙午\n" +
            "未丁丁未\n" +
            "未丁戊申\n" +
            "未丁己酉\n" +
            "未丁庚戌\n" +
            "未丁辛亥\n" +
            "未戊壬子\n" +
            "未戊癸丑\n" +
            "未戊甲寅\n" +
            "未戊乙卯\n" +
            "未戊丙辰\n" +
            "未戊丁巳\n" +
            "未戊戊午\n" +
            "未戊己未\n" +
            "未戊庚申\n" +
            "未戊辛酉\n" +
            "未戊壬戌\n" +
            "未戊癸亥\n" +
            "未己甲子\n" +
            "未己乙丑\n" +
            "未己丙寅\n" +
            "未己丁卯\n" +
            "未己戊辰\n" +
            "未己己巳\n" +
            "未己庚午\n" +
            "未己辛未\n" +
            "未己壬申\n" +
            "未己癸酉\n" +
            "未己甲戌\n" +
            "未己乙亥\n" +
            "未庚丙子\n" +
            "未庚丁丑\n" +
            "未庚戊寅\n" +
            "未庚己卯\n" +
            "未庚庚辰\n" +
            "未庚辛巳\n" +
            "未庚壬午\n" +
            "未庚癸未\n" +
            "未庚甲申\n" +
            "未庚乙酉\n" +
            "未庚丙戌\n" +
            "未庚丁亥\n" +
            "未辛戊子\n" +
            "未辛己丑\n" +
            "未辛庚寅\n" +
            "未辛辛卯\n" +
            "未辛壬辰\n" +
            "未辛癸巳\n" +
            "未辛甲午\n" +
            "未辛乙未\n" +
            "未辛丙申\n" +
            "未辛丁酉\n" +
            "未辛戊戌\n" +
            "未辛己亥\n" +
            "未壬庚子\n" +
            "未壬辛丑\n" +
            "未壬壬寅\n" +
            "未壬癸卯\n" +
            "未壬甲辰\n" +
            "未壬乙巳\n" +
            "未壬丙午\n" +
            "未壬丁未\n" +
            "未壬戊申\n" +
            "未壬己酉\n" +
            "未壬庚戌\n" +
            "未壬辛亥\n" +
            "未癸壬子\n" +
            "未癸癸丑\n" +
            "未癸甲寅\n" +
            "未癸乙卯\n" +
            "未癸丙辰\n" +
            "未癸丁巳\n" +
            "未癸戊午\n" +
            "未癸己未\n" +
            "未癸庚申\n" +
            "未癸辛酉\n" +
            "未癸壬戌\n" +
            "未癸癸亥\n" +
            "申甲甲子\n" +
            "申甲乙丑\n" +
            "申甲丙寅\n" +
            "申甲丁卯\n" +
            "申甲戊辰\n" +
            "申甲己巳\n" +
            "申甲庚午\n" +
            "申甲辛未\n" +
            "申甲壬申\n" +
            "申甲癸酉\n" +
            "申甲甲戌\n" +
            "申甲乙亥\n" +
            "申乙丙子\n" +
            "申乙丁丑\n" +
            "申乙戊寅\n" +
            "申乙己卯\n" +
            "申乙庚辰\n" +
            "申乙辛巳\n" +
            "申乙壬午\n" +
            "申乙癸未\n" +
            "申乙甲申\n" +
            "申乙乙酉\n" +
            "申乙丙戌\n" +
            "申乙丁亥\n" +
            "申丙戊子\n" +
            "申丙己丑\n" +
            "申丙庚寅\n" +
            "申丙辛卯\n" +
            "申丙壬辰\n" +
            "申丙癸巳\n" +
            "申丙甲午\n" +
            "申丙乙未\n" +
            "申丙丙申\n" +
            "申丙丁酉\n" +
            "申丙戊戌\n" +
            "申丙己亥\n" +
            "申丁庚子\n" +
            "申丁辛丑\n" +
            "申丁壬寅\n" +
            "申丁癸卯\n" +
            "申丁甲辰\n" +
            "申丁乙巳\n" +
            "申丁丙午\n" +
            "申丁丁未\n" +
            "申丁戊申\n" +
            "申丁己酉\n" +
            "申丁庚戌\n" +
            "申丁辛亥\n" +
            "申戊壬子\n" +
            "申戊癸丑\n" +
            "申戊甲寅\n" +
            "申戊乙卯\n" +
            "申戊丙辰\n" +
            "申戊丁巳\n" +
            "申戊戊午\n" +
            "申戊己未\n" +
            "申戊庚申\n" +
            "申戊辛酉\n" +
            "申戊壬戌\n" +
            "申戊癸亥\n" +
            "申己甲子\n" +
            "申己乙丑\n" +
            "申己丙寅\n" +
            "申己丁卯\n" +
            "申己戊辰\n" +
            "申己己巳\n" +
            "申己庚午\n" +
            "申己辛未\n" +
            "申己壬申\n" +
            "申己癸酉\n" +
            "申己甲戌\n" +
            "申己乙亥\n" +
            "申庚丙子\n" +
            "申庚丁丑\n" +
            "申庚戊寅\n" +
            "申庚己卯\n" +
            "申庚庚辰\n" +
            "申庚辛巳\n" +
            "申庚壬午\n" +
            "申庚癸未\n" +
            "申庚甲申\n" +
            "申庚乙酉\n" +
            "申庚丙戌\n" +
            "申庚丁亥\n" +
            "申辛戊子\n" +
            "申辛己丑\n" +
            "申辛庚寅\n" +
            "申辛辛卯\n" +
            "申辛壬辰\n" +
            "申辛癸巳\n" +
            "申辛甲午\n" +
            "申辛乙未\n" +
            "申辛丙申\n" +
            "申辛丁酉\n" +
            "申辛戊戌\n" +
            "申辛己亥\n" +
            "申壬庚子\n" +
            "申壬辛丑\n" +
            "申壬壬寅\n" +
            "申壬癸卯\n" +
            "申壬甲辰\n" +
            "申壬乙巳\n" +
            "申壬丙午\n" +
            "申壬丁未\n" +
            "申壬戊申\n" +
            "申壬己酉\n" +
            "申壬庚戌\n" +
            "申壬辛亥\n" +
            "申癸壬子\n" +
            "申癸癸丑\n" +
            "申癸甲寅\n" +
            "申癸乙卯\n" +
            "申癸丙辰\n" +
            "申癸丁巳\n" +
            "申癸戊午\n" +
            "申癸己未\n" +
            "申癸庚申\n" +
            "申癸辛酉\n" +
            "申癸壬戌\n" +
            "申癸癸亥\n" +
            "酉甲甲子\n" +
            "酉甲乙丑\n" +
            "酉甲丙寅\n" +
            "酉甲丁卯\n" +
            "酉甲戊辰\n" +
            "酉甲己巳\n" +
            "酉甲庚午\n" +
            "酉甲辛未\n" +
            "酉甲壬申\n" +
            "酉甲癸酉\n" +
            "酉甲甲戌\n" +
            "酉甲乙亥\n" +
            "酉乙丙子\n" +
            "酉乙丁丑\n" +
            "酉乙戊寅\n" +
            "酉乙己卯\n" +
            "酉乙庚辰\n" +
            "酉乙辛巳\n" +
            "酉乙壬午\n" +
            "酉乙癸未\n" +
            "酉乙甲申\n" +
            "酉乙乙酉\n" +
            "酉乙丙戌\n" +
            "酉乙丁亥\n" +
            "酉丙戊子\n" +
            "酉丙己丑\n" +
            "酉丙庚寅\n" +
            "酉丙辛卯\n" +
            "酉丙壬辰\n" +
            "酉丙癸巳\n" +
            "酉丙甲午\n" +
            "酉丙乙未\n" +
            "酉丙丙申\n" +
            "酉丙丁酉\n" +
            "酉丙戊戌\n" +
            "酉丙己亥\n" +
            "酉丁庚子\n" +
            "酉丁辛丑\n" +
            "酉丁壬寅\n" +
            "酉丁癸卯\n" +
            "酉丁甲辰\n" +
            "酉丁乙巳\n" +
            "酉丁丙午\n" +
            "酉丁丁未\n" +
            "酉丁戊申\n" +
            "酉丁己酉\n" +
            "酉丁庚戌\n" +
            "酉丁辛亥\n" +
            "酉戊壬子\n" +
            "酉戊癸丑\n" +
            "酉戊甲寅\n" +
            "酉戊乙卯\n" +
            "酉戊丙辰\n" +
            "酉戊丁巳\n" +
            "酉戊戊午\n" +
            "酉戊己未\n" +
            "酉戊庚申\n" +
            "酉戊辛酉\n" +
            "酉戊壬戌\n" +
            "酉戊癸亥\n" +
            "酉己甲子\n" +
            "酉己乙丑\n" +
            "酉己丙寅\n" +
            "酉己丁卯\n" +
            "酉己戊辰\n" +
            "酉己己巳\n" +
            "酉己庚午\n" +
            "酉己辛未\n" +
            "酉己壬申\n" +
            "酉己癸酉\n" +
            "酉己甲戌\n" +
            "酉己乙亥\n" +
            "酉庚丙子\n" +
            "酉庚丁丑\n" +
            "酉庚戊寅\n" +
            "酉庚己卯\n" +
            "酉庚庚辰\n" +
            "酉庚辛巳\n" +
            "酉庚壬午\n" +
            "酉庚癸未\n" +
            "酉庚甲申\n" +
            "酉庚乙酉\n" +
            "酉庚丙戌\n" +
            "酉庚丁亥\n" +
            "酉辛戊子\n" +
            "酉辛己丑\n" +
            "酉辛庚寅\n" +
            "酉辛辛卯\n" +
            "酉辛壬辰\n" +
            "酉辛癸巳\n" +
            "酉辛甲午\n" +
            "酉辛乙未\n" +
            "酉辛丙申\n" +
            "酉辛丁酉\n" +
            "酉辛戊戌\n" +
            "酉辛己亥\n" +
            "酉壬庚子\n" +
            "酉壬辛丑\n" +
            "酉壬壬寅\n" +
            "酉壬癸卯\n" +
            "酉壬甲辰\n" +
            "酉壬乙巳\n" +
            "酉壬丙午\n" +
            "酉壬丁未\n" +
            "酉壬戊申\n" +
            "酉壬己酉\n" +
            "酉壬庚戌\n" +
            "酉壬辛亥\n" +
            "酉癸壬子\n" +
            "酉癸癸丑\n" +
            "酉癸甲寅\n" +
            "酉癸乙卯\n" +
            "酉癸丙辰\n" +
            "酉癸丁巳\n" +
            "酉癸戊午\n" +
            "酉癸己未\n" +
            "酉癸庚申\n" +
            "酉癸辛酉\n" +
            "酉癸壬戌\n" +
            "酉癸癸亥\n" +
            "戌甲甲子\n" +
            "戌甲乙丑\n" +
            "戌甲丙寅\n" +
            "戌甲丁卯\n" +
            "戌甲戊辰\n" +
            "戌甲己巳\n" +
            "戌甲庚午\n" +
            "戌甲辛未\n" +
            "戌甲壬申\n" +
            "戌甲癸酉\n" +
            "戌甲甲戌\n" +
            "戌甲乙亥\n" +
            "戌乙丙子\n" +
            "戌乙丁丑\n" +
            "戌乙戊寅\n" +
            "戌乙己卯\n" +
            "戌乙庚辰\n" +
            "戌乙辛巳\n" +
            "戌乙壬午\n" +
            "戌乙癸未\n" +
            "戌乙甲申\n" +
            "戌乙乙酉\n" +
            "戌乙丙戌\n" +
            "戌乙丁亥\n" +
            "戌丙戊子\n" +
            "戌丙己丑\n" +
            "戌丙庚寅\n" +
            "戌丙辛卯\n" +
            "戌丙壬辰\n" +
            "戌丙癸巳\n" +
            "戌丙甲午\n" +
            "戌丙乙未\n" +
            "戌丙丙申\n" +
            "戌丙丁酉\n" +
            "戌丙戊戌\n" +
            "戌丙己亥\n" +
            "戌丁庚子\n" +
            "戌丁辛丑\n" +
            "戌丁壬寅\n" +
            "戌丁癸卯\n" +
            "戌丁甲辰\n" +
            "戌丁乙巳\n" +
            "戌丁丙午\n" +
            "戌丁丁未\n" +
            "戌丁戊申\n" +
            "戌丁己酉\n" +
            "戌丁庚戌\n" +
            "戌丁辛亥\n" +
            "戌戊壬子\n" +
            "戌戊癸丑\n" +
            "戌戊甲寅\n" +
            "戌戊乙卯\n" +
            "戌戊丙辰\n" +
            "戌戊丁巳\n" +
            "戌戊戊午\n" +
            "戌戊己未\n" +
            "戌戊庚申\n" +
            "戌戊辛酉\n" +
            "戌戊壬戌\n" +
            "戌戊癸亥\n" +
            "戌己甲子\n" +
            "戌己乙丑\n" +
            "戌己丙寅\n" +
            "戌己丁卯\n" +
            "戌己戊辰\n" +
            "戌己己巳\n" +
            "戌己庚午\n" +
            "戌己辛未\n" +
            "戌己壬申\n" +
            "戌己癸酉\n" +
            "戌己甲戌\n" +
            "戌己乙亥\n" +
            "戌庚丙子\n" +
            "戌庚丁丑\n" +
            "戌庚戊寅\n" +
            "戌庚己卯\n" +
            "戌庚庚辰\n" +
            "戌庚辛巳\n" +
            "戌庚壬午\n" +
            "戌庚癸未\n" +
            "戌庚甲申\n" +
            "戌庚乙酉\n" +
            "戌庚丙戌\n" +
            "戌庚丁亥\n" +
            "戌辛戊子\n" +
            "戌辛己丑\n" +
            "戌辛庚寅\n" +
            "戌辛辛卯\n" +
            "戌辛壬辰\n" +
            "戌辛癸巳\n" +
            "戌辛甲午\n" +
            "戌辛乙未\n" +
            "戌辛丙申\n" +
            "戌辛丁酉\n" +
            "戌辛戊戌\n" +
            "戌辛己亥\n" +
            "戌壬庚子\n" +
            "戌壬辛丑\n" +
            "戌壬壬寅\n" +
            "戌壬癸卯\n" +
            "戌壬甲辰\n" +
            "戌壬乙巳\n" +
            "戌壬丙午\n" +
            "戌壬丁未\n" +
            "戌壬戊申\n" +
            "戌壬己酉\n" +
            "戌壬庚戌\n" +
            "戌壬辛亥\n" +
            "戌癸壬子\n" +
            "戌癸癸丑\n" +
            "戌癸甲寅\n" +
            "戌癸乙卯\n" +
            "戌癸丙辰\n" +
            "戌癸丁巳\n" +
            "戌癸戊午\n" +
            "戌癸己未\n" +
            "戌癸庚申\n" +
            "戌癸辛酉\n" +
            "戌癸壬戌\n" +
            "戌癸癸亥\n" +
            "亥甲甲子\n" +
            "亥甲乙丑\n" +
            "亥甲丙寅\n" +
            "亥甲丁卯\n" +
            "亥甲戊辰\n" +
            "亥甲己巳\n" +
            "亥甲庚午\n" +
            "亥甲辛未\n" +
            "亥甲壬申\n" +
            "亥甲癸酉\n" +
            "亥甲甲戌\n" +
            "亥甲乙亥\n" +
            "亥乙丙子\n" +
            "亥乙丁丑\n" +
            "亥乙戊寅\n" +
            "亥乙己卯\n" +
            "亥乙庚辰\n" +
            "亥乙辛巳\n" +
            "亥乙壬午\n" +
            "亥乙癸未\n" +
            "亥乙甲申\n" +
            "亥乙乙酉\n" +
            "亥乙丙戌\n" +
            "亥乙丁亥\n" +
            "亥丙戊子\n" +
            "亥丙己丑\n" +
            "亥丙庚寅\n" +
            "亥丙辛卯\n" +
            "亥丙壬辰\n" +
            "亥丙癸巳\n" +
            "亥丙甲午\n" +
            "亥丙乙未\n" +
            "亥丙丙申\n" +
            "亥丙丁酉\n" +
            "亥丙戊戌\n" +
            "亥丙己亥\n" +
            "亥丁庚子\n" +
            "亥丁辛丑\n" +
            "亥丁壬寅\n" +
            "亥丁癸卯\n" +
            "亥丁甲辰\n" +
            "亥丁乙巳\n" +
            "亥丁丙午\n" +
            "亥丁丁未\n" +
            "亥丁戊申\n" +
            "亥丁己酉\n" +
            "亥丁庚戌\n" +
            "亥丁辛亥\n" +
            "亥戊壬子\n" +
            "亥戊癸丑\n" +
            "亥戊甲寅\n" +
            "亥戊乙卯\n" +
            "亥戊丙辰\n" +
            "亥戊丁巳\n" +
            "亥戊戊午\n" +
            "亥戊己未\n" +
            "亥戊庚申\n" +
            "亥戊辛酉\n" +
            "亥戊壬戌\n" +
            "亥戊癸亥\n" +
            "亥己甲子\n" +
            "亥己乙丑\n" +
            "亥己丙寅\n" +
            "亥己丁卯\n" +
            "亥己戊辰\n" +
            "亥己己巳\n" +
            "亥己庚午\n" +
            "亥己辛未\n" +
            "亥己壬申\n" +
            "亥己癸酉\n" +
            "亥己甲戌\n" +
            "亥己乙亥\n" +
            "亥庚丙子\n" +
            "亥庚丁丑\n" +
            "亥庚戊寅\n" +
            "亥庚己卯\n" +
            "亥庚庚辰\n" +
            "亥庚辛巳\n" +
            "亥庚壬午\n" +
            "亥庚癸未\n" +
            "亥庚甲申\n" +
            "亥庚乙酉\n" +
            "亥庚丙戌\n" +
            "亥庚丁亥\n" +
            "亥辛戊子\n" +
            "亥辛己丑\n" +
            "亥辛庚寅\n" +
            "亥辛辛卯\n" +
            "亥辛壬辰\n" +
            "亥辛癸巳\n" +
            "亥辛甲午\n" +
            "亥辛乙未\n" +
            "亥辛丙申\n" +
            "亥辛丁酉\n" +
            "亥辛戊戌\n" +
            "亥辛己亥\n" +
            "亥壬庚子\n" +
            "亥壬辛丑\n" +
            "亥壬壬寅\n" +
            "亥壬癸卯\n" +
            "亥壬甲辰\n" +
            "亥壬乙巳\n" +
            "亥壬丙午\n" +
            "亥壬丁未\n" +
            "亥壬戊申\n" +
            "亥壬己酉\n" +
            "亥壬庚戌\n" +
            "亥壬辛亥\n" +
            "亥癸壬子\n" +
            "亥癸癸丑\n" +
            "亥癸甲寅\n" +
            "亥癸乙卯\n" +
            "亥癸丙辰\n" +
            "亥癸丁巳\n" +
            "亥癸戊午\n" +
            "亥癸己未\n" +
            "亥癸庚申\n" +
            "亥癸辛酉\n" +
            "亥癸壬戌\n" +
            "亥癸癸亥\n" +
            "子甲甲子\n" +
            "子甲乙丑\n" +
            "子甲丙寅\n" +
            "子甲丁卯\n" +
            "子甲戊辰\n" +
            "子甲己巳\n" +
            "子甲庚午\n" +
            "子甲辛未\n" +
            "子甲壬申\n" +
            "子甲癸酉\n" +
            "子甲甲戌\n" +
            "子甲乙亥\n" +
            "子乙丙子\n" +
            "子乙丁丑\n" +
            "子乙戊寅\n" +
            "子乙己卯\n" +
            "子乙庚辰\n" +
            "子乙辛巳\n" +
            "子乙壬午\n" +
            "子乙癸未\n" +
            "子乙甲申\n" +
            "子乙乙酉\n" +
            "子乙丙戌\n" +
            "子乙丁亥\n" +
            "子丙戊子\n" +
            "子丙己丑\n" +
            "子丙庚寅\n" +
            "子丙辛卯\n" +
            "子丙壬辰\n" +
            "子丙癸巳\n" +
            "子丙甲午\n" +
            "子丙乙未\n" +
            "子丙丙申\n" +
            "子丙丁酉\n" +
            "子丙戊戌\n" +
            "子丙己亥\n" +
            "子丁庚子\n" +
            "子丁辛丑\n" +
            "子丁壬寅\n" +
            "子丁癸卯\n" +
            "子丁甲辰\n" +
            "子丁乙巳\n" +
            "子丁丙午\n" +
            "子丁丁未\n" +
            "子丁戊申\n" +
            "子丁己酉\n" +
            "子丁庚戌\n" +
            "子丁辛亥\n" +
            "子戊壬子\n" +
            "子戊癸丑\n" +
            "子戊甲寅\n" +
            "子戊乙卯\n" +
            "子戊丙辰\n" +
            "子戊丁巳\n" +
            "子戊戊午\n" +
            "子戊己未\n" +
            "子戊庚申\n" +
            "子戊辛酉\n" +
            "子戊壬戌\n" +
            "子戊癸亥\n" +
            "子己甲子\n" +
            "子己乙丑\n" +
            "子己丙寅\n" +
            "子己丁卯\n" +
            "子己戊辰\n" +
            "子己己巳\n" +
            "子己庚午\n" +
            "子己辛未\n" +
            "子己壬申\n" +
            "子己癸酉\n" +
            "子己甲戌\n" +
            "子己乙亥\n" +
            "子庚丙子\n" +
            "子庚丁丑\n" +
            "子庚戊寅\n" +
            "子庚己卯\n" +
            "子庚庚辰\n" +
            "子庚辛巳\n" +
            "子庚壬午\n" +
            "子庚癸未\n" +
            "子庚甲申\n" +
            "子庚乙酉\n" +
            "子庚丙戌\n" +
            "子庚丁亥\n" +
            "子辛戊子\n" +
            "子辛己丑\n" +
            "子辛庚寅\n" +
            "子辛辛卯\n" +
            "子辛壬辰\n" +
            "子辛癸巳\n" +
            "子辛甲午\n" +
            "子辛乙未\n" +
            "子辛丙申\n" +
            "子辛丁酉\n" +
            "子辛戊戌\n" +
            "子辛己亥\n" +
            "子壬庚子\n" +
            "子壬辛丑\n" +
            "子壬壬寅\n" +
            "子壬癸卯\n" +
            "子壬甲辰\n" +
            "子壬乙巳\n" +
            "子壬丙午\n" +
            "子壬丁未\n" +
            "子壬戊申\n" +
            "子壬己酉\n" +
            "子壬庚戌\n" +
            "子壬辛亥\n" +
            "子癸壬子\n" +
            "子癸癸丑\n" +
            "子癸甲寅\n" +
            "子癸乙卯\n" +
            "子癸丙辰\n" +
            "子癸丁巳\n" +
            "子癸戊午\n" +
            "子癸己未\n" +
            "子癸庚申\n" +
            "子癸辛酉\n" +
            "子癸壬戌\n" +
            "子癸癸亥\n" +
            "丑甲甲子\n" +
            "丑甲乙丑\n" +
            "丑甲丙寅\n" +
            "丑甲丁卯\n" +
            "丑甲戊辰\n" +
            "丑甲己巳\n" +
            "丑甲庚午\n" +
            "丑甲辛未\n" +
            "丑甲壬申\n" +
            "丑甲癸酉\n" +
            "丑甲甲戌\n" +
            "丑甲乙亥\n" +
            "丑乙丙子\n" +
            "丑乙丁丑\n" +
            "丑乙戊寅\n" +
            "丑乙己卯\n" +
            "丑乙庚辰\n" +
            "丑乙辛巳\n" +
            "丑乙壬午\n" +
            "丑乙癸未\n" +
            "丑乙甲申\n" +
            "丑乙乙酉\n" +
            "丑乙丙戌\n" +
            "丑乙丁亥\n" +
            "丑丙戊子\n" +
            "丑丙己丑\n" +
            "丑丙庚寅\n" +
            "丑丙辛卯\n" +
            "丑丙壬辰\n" +
            "丑丙癸巳\n" +
            "丑丙甲午\n" +
            "丑丙乙未\n" +
            "丑丙丙申\n" +
            "丑丙丁酉\n" +
            "丑丙戊戌\n" +
            "丑丙己亥\n" +
            "丑丁庚子\n" +
            "丑丁辛丑\n" +
            "丑丁壬寅\n" +
            "丑丁癸卯\n" +
            "丑丁甲辰\n" +
            "丑丁乙巳\n" +
            "丑丁丙午\n" +
            "丑丁丁未\n" +
            "丑丁戊申\n" +
            "丑丁己酉\n" +
            "丑丁庚戌\n" +
            "丑丁辛亥\n" +
            "丑戊壬子\n" +
            "丑戊癸丑\n" +
            "丑戊甲寅\n" +
            "丑戊乙卯\n" +
            "丑戊丙辰\n" +
            "丑戊丁巳\n" +
            "丑戊戊午\n" +
            "丑戊己未\n" +
            "丑戊庚申\n" +
            "丑戊辛酉\n" +
            "丑戊壬戌\n" +
            "丑戊癸亥\n" +
            "丑己甲子\n" +
            "丑己乙丑\n" +
            "丑己丙寅\n" +
            "丑己丁卯\n" +
            "丑己戊辰\n" +
            "丑己己巳\n" +
            "丑己庚午\n" +
            "丑己辛未\n" +
            "丑己壬申\n" +
            "丑己癸酉\n" +
            "丑己甲戌\n" +
            "丑己乙亥\n" +
            "丑庚丙子\n" +
            "丑庚丁丑\n" +
            "丑庚戊寅\n" +
            "丑庚己卯\n" +
            "丑庚庚辰\n" +
            "丑庚辛巳\n" +
            "丑庚壬午\n" +
            "丑庚癸未\n" +
            "丑庚甲申\n" +
            "丑庚乙酉\n" +
            "丑庚丙戌\n" +
            "丑庚丁亥\n" +
            "丑辛戊子\n" +
            "丑辛己丑\n" +
            "丑辛庚寅\n" +
            "丑辛辛卯\n" +
            "丑辛壬辰\n" +
            "丑辛癸巳\n" +
            "丑辛甲午\n" +
            "丑辛乙未\n" +
            "丑辛丙申\n" +
            "丑辛丁酉\n" +
            "丑辛戊戌\n" +
            "丑辛己亥\n" +
            "丑壬庚子\n" +
            "丑壬辛丑\n" +
            "丑壬壬寅\n" +
            "丑壬癸卯\n" +
            "丑壬甲辰\n" +
            "丑壬乙巳\n" +
            "丑壬丙午\n" +
            "丑壬丁未\n" +
            "丑壬戊申\n" +
            "丑壬己酉\n" +
            "丑壬庚戌\n" +
            "丑壬辛亥\n" +
            "丑癸壬子\n" +
            "丑癸癸丑\n" +
            "丑癸甲寅\n" +
            "丑癸乙卯\n" +
            "丑癸丙辰\n" +
            "丑癸丁巳\n" +
            "丑癸戊午\n" +
            "丑癸己未\n" +
            "丑癸庚申\n" +
            "丑癸辛酉\n" +
            "丑癸壬戌\n" +
            "丑癸癸亥";
    let ret = -1;
    let arr = data.split("\n");
    //日柱，时柱
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] == bz[3] + bz[4] + bz[6] + bz[7]) {
            ret = i + 1;
            break;
        }
    }
    return ret;
}

function getBookGeJi5(geju, bz) {
    //HashMap<String, String[]> mapdata = new HashMap<String, String[]>();
    let rigan = bz[4];
    let mapData = {
        "论正官": ["正官", "杂气正官"],
        "论正官取运": ["正官", "杂气正官"],
        "论偏官": ["七杀", "杂气七杀"],
        "论偏官取运": ["七杀", "杂气七杀"],
        "论财": ["正财", "偏财", "杂气正财", "杂气偏财"],
        "论财取运": ["正财", "偏财", "杂气正财", "杂气偏财"],
        "论印绶": ["正印", "偏印", "杂气正印", "杂气偏印"],
        "论印绶取运": ["正印", "偏印", "杂气正印", "杂气偏印"],
        "论食神": ["食神", "杂气食神"],
        "论食神取运": ["食神", "杂气食神"],
        "论伤官": ["伤官", "杂气伤官"],
        "论伤官取运": ["伤官", "杂气伤官"],
        "论建禄月劫": ["建禄-", "羊刃-"],
        "论建禄月劫取运": ["建禄-", "羊刃-"],
        "论阳刃": ["羊刃+"],
        "论阳刃取运": ["羊刃+"],
        "论弃命从财格": ["从财", "疑似从财"],
        "论弃命从煞格": ["从杀", "疑似从杀"],
        "论专旺格": ["专旺", "疑似专旺", "曲直", "疑似曲直", "炎上", "疑似炎上", "润下", "疑似润下", "从革", "疑似从革", "稼穑", "疑似稼穑"]
    }
    
    let riganyy = getGZYinYang(rigan);
    let ret = [];
    for (const key in mapData) {
        if (Object.hasOwnProperty.call(mapData, key)) {
            const element = mapData[key];
            for (let i = 0; i < element.length; i++) {
                let item = element[i];
                let yyflag = 1;
                if (item.indexOf("-") > -1) {
                    if (riganyy == 1){
                        yyflag = false;
                    }
                    item = item.replace("-", "");
                }
                if (item.indexOf("+") > -1) {
                    if (riganyy == 0){
                        yyflag = false;
                    }
                    item = item.replace("+", "");
                }
                if (item == geju && yyflag) {
                    if (ret.indexOf(key)) {
                        ret.push(key)
                    }
                }
            }
        }
    }
    return ret;
}

function getIndex5_1(bz,geju) {
    let data = "论正官\n" +
            "论正官取运\n" +
            "论偏官\n" +
            "论偏官取运\n" +
            "论财\n" +
            "论财取运\n" +
            "论印绶\n" +
            "论印绶取运\n" +
            "论食神\n" +
            "论食神取运\n" +
            "论伤官\n" +
            "论伤官取运\n" +
            "论建禄月劫\n" +
            "论建禄月劫取运\n" +
            "论阳刃\n" +
            "论阳刃取运\n" +
            "论弃命从财格\n" +
            "论弃命从煞格\n" +
            "论专旺格";
    let ret = -1;
    let arr = data.split("\n");
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] == geju) {
            ret = i + 1;
            break;
        }
    }
    return ret;
}

function getBookGeJu6(geju) {
    let mapData = {
    "论正官格": ["正官", "杂气正官"],
    "论杂气财官格": ["杂气正官", "杂气七杀", "杂气正财", "杂气偏财"],
    "论印绶格": ["正印", "偏印", "杂气正印", "杂气偏印"],
    "论杂气印绶格": ["杂气正印", "杂气偏印"],
    "论炎上格": ["炎上", "疑似炎上"],
    "论润下格": ["润下", "疑似润下"],
    "论从革格": ["从革", "疑似从革"],
    "论稼穑格": ["稼穑", "疑似稼穑"],
    "论曲直格": ["曲直", "疑似曲直"],
    "论弃命从财格": ["从财", "疑似从财"],
    "论弃命从杀格": ["从杀", "疑似从杀"],
    "论伤官": ["伤官", "杂气伤官"],
    "论食神": ["食神", "杂气食神"],
    "论正财": ["正财", "杂气正财"],
    "论偏财": ["偏财", "杂气偏财"],
    "论正官": ["正官", "杂气正官"],
    "论偏官": ["七杀", "杂气七杀"],
    "论七杀": ["七杀", "杂气七杀"],
    "论印绶": ["印绶", "杂气印绶"],
    "论倒食": ["偏印", "杂气偏印"],
    "论劫财": ["羊刃"]
    }

    let ret = [];
    for (const key in mapData) {
        if (Object.hasOwnProperty.call(mapData, key)) {
            const element = mapData[key];
            for (let i = 0; i < element.length; i++) {
                let item = element[i];
                if (item == geju) {
                    if (ret.indexOf(key)) {
                        ret.push(key)
                    }
                }
            }
        }
    }
    return ret;
}

function getIndex6_1(bz,geju) {
    let data = "论正官格\n" +
            "论杂气财官格\n" +
            "论印绶格\n" +
            "论杂气印绶格\n" +
            "论炎上格\n" +
            "论润下格\n" +
            "论从革格\n" +
            "论稼穑格\n" +
            "论曲直格\n" +
            "论弃命从财格\n" +
            "论弃命从杀格\n" +
            "论伤官\n" +
            "论食神\n" +
            "论正财\n" +
            "论偏财\n" +
            "论正官\n" +
            "论偏官\n" +
            "论七杀\n" +
            "论印绶\n" +
            "论倒食\n" +
            "论劫财";
    let ret = -1;
    let arr = data.split("\n");
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] == geju) {
            ret = i + 1;
            break;
        }
    }
    return ret;
}

function getIndex6_2(bz) {
    let data = "甲\n" +
            "乙\n" +
            "丙\n" +
            "丁\n" +
            "戊\n" +
            "己\n" +
            "庚\n" +
            "辛\n" +
            "壬\n" +
            "癸";
    let ret = -1;
    let arr = data.split("\n");
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] == bz[4]) {
            ret = i + 1;
            break;
        }
    }
    return ret;
}

function getIndex6_3(bz) {
    let data = "子\n" +
            "丑\n" +
            "寅\n" +
            "卯\n" +
            "辰\n" +
            "巳\n" +
            "午\n" +
            "未\n" +
            "申\n" +
            "酉\n" +
            "戌\n" +
            "亥";
    let ret = -1;
    let arr = data.split("\n");
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] == bz[3]) {
            ret = i + 1;
            break;
        }
    }
    return ret;
}

function getIndex6_4_Title(bz) {
    let data = "寅\n" +
            "卯\n" +
            "辰\n" +
            "巳\n" +
            "午\n" +
            "未\n" +
            "申\n" +
            "酉\n" +
            "戌\n" +
            "亥\n" +
            "子\n" +
            "丑";

    let retArr = ["论正月建寅候", "论二月建卯候", "论三月建辰候", "论四月建巳候", "论五月建午候", "论六月建未候", "论七月建申候", "论八月建酉候", "论九月建戌候", "论十月建亥候", "论十一月建子候", "论十二月建丑候"];
    let ret = "";
    let arr = data.split("\n");
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] == bz[3]) {
            ret = retArr[i];
            break;
        }
    }
    return ret;
}

function getIndex6_4(bz) {
    let data = "寅\n" +
            "卯\n" +
            "辰\n" +
            "巳\n" +
            "午\n" +
            "未\n" +
            "申\n" +
            "酉\n" +
            "戌\n" +
            "亥\n" +
            "子\n" +
            "丑";
    let ret = -1;
    let arr = data.split("\n");
    for (let i = 0; i < arr.length; i++) {
        if (arr[i]==bz[3]) {
            ret = i + 1;
            break;
        }
    }
    return ret;
}

function getIndex7_1(bz) {
    let data = "甲子\n" +
            "甲寅\n" +
            "甲辰\n" +
            "甲午\n" +
            "甲申\n" +
            "甲戌\n" +
            "乙丑\n" +
            "乙卯\n" +
            "乙巳\n" +
            "乙未\n" +
            "乙酉\n" +
            "乙亥\n" +
            "丙子\n" +
            "丙寅\n" +
            "丙辰\n" +
            "丙午\n" +
            "丙申\n" +
            "丙戌\n" +
            "丁丑\n" +
            "丁卯\n" +
            "丁巳\n" +
            "丁未\n" +
            "丁酉\n" +
            "丁亥\n" +
            "戊辰\n" +
            "戊寅\n" +
            "戊子\n" +
            "戊戌\n" +
            "戊申\n" +
            "戊午\n" +
            "己丑\n" +
            "己卯\n" +
            "己巳\n" +
            "己未\n" +
            "己酉\n" +
            "己亥\n" +
            "庚子\n" +
            "庚寅\n" +
            "庚辰\n" +
            "庚午\n" +
            "庚申\n" +
            "庚戌\n" +
            "辛丑\n" +
            "辛卯\n" +
            "辛巳\n" +
            "辛未\n" +
            "辛酉\n" +
            "辛亥\n" +
            "壬子\n" +
            "壬寅\n" +
            "壬辰\n" +
            "壬午\n" +
            "壬申\n" +
            "壬戌\n" +
            "癸丑\n" +
            "癸卯\n" +
            "癸巳\n" +
            "癸未\n" +
            "癸酉\n" +
            "癸亥";
    let ret = -1;
    let arr = data.split("\n");
    //日柱，时柱
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] == bz[4] + bz[5]) {
            ret = i + 1;
            break;
        }
    }
    return ret;
}

function getIndex7_2(bz) {
    let data = "甲子\n" +
            "乙丑\n" +
            "丙寅\n" +
            "丁卯\n" +
            "戊辰\n" +
            "己巳\n" +
            "庚午\n" +
            "辛未\n" +
            "壬申\n" +
            "癸酉\n" +
            "甲戌\n" +
            "乙亥\n" +
            "丙子\n" +
            "丁丑\n" +
            "戊寅\n" +
            "己卯\n" +
            "庚辰\n" +
            "辛巳\n" +
            "壬午\n" +
            "癸未\n" +
            "甲申\n" +
            "乙酉\n" +
            "丙戌\n" +
            "丁亥\n" +
            "戊子\n" +
            "己丑\n" +
            "庚寅\n" +
            "辛卯\n" +
            "壬辰\n" +
            "癸巳\n" +
            "甲午\n" +
            "乙未\n" +
            "丙申\n" +
            "丁酉\n" +
            "戊戌\n" +
            "己亥\n" +
            "庚子\n" +
            "辛丑\n" +
            "壬寅\n" +
            "癸卯\n" +
            "甲辰\n" +
            "乙巳\n" +
            "丙午\n" +
            "丁未\n" +
            "戊申\n" +
            "己酉\n" +
            "庚戌\n" +
            "辛亥\n" +
            "壬子\n" +
            "癸丑\n" +
            "甲寅\n" +
            "乙卯\n" +
            "丙辰\n" +
            "丁巳\n" +
            "戊午\n" +
            "己未\n" +
            "庚申\n" +
            "辛酉\n" +
            "壬戌\n" +
            "癸亥\n" +
            "甲子\n" +
            "乙丑\n" +
            "丙寅\n" +
            "丁卯\n" +
            "戊辰\n" +
            "己巳\n" +
            "庚午\n" +
            "辛未\n" +
            "壬申\n" +
            "癸酉\n" +
            "甲戌\n" +
            "乙亥\n" +
            "丙子\n" +
            "丁丑\n" +
            "戊寅\n" +
            "己卯\n" +
            "庚辰\n" +
            "辛巳\n" +
            "壬午\n" +
            "癸未\n" +
            "甲申\n" +
            "乙酉\n" +
            "丙戌\n" +
            "丁亥\n" +
            "戊子\n" +
            "己丑\n" +
            "庚寅\n" +
            "辛卯\n" +
            "壬辰\n" +
            "癸巳\n" +
            "甲午\n" +
            "乙未\n" +
            "丙申\n" +
            "丁酉\n" +
            "戊戌\n" +
            "己亥\n" +
            "庚子\n" +
            "辛丑\n" +
            "壬寅\n" +
            "癸卯\n" +
            "甲辰\n" +
            "乙巳\n" +
            "丙午\n" +
            "丁未\n" +
            "戊申\n" +
            "己酉\n" +
            "庚戌\n" +
            "辛亥\n" +
            "壬子\n" +
            "癸丑\n" +
            "甲寅\n" +
            "乙卯\n" +
            "丙辰\n" +
            "丁巳\n" +
            "戊午\n" +
            "己未\n" +
            "庚申\n" +
            "辛酉\n" +
            "壬戌\n" +
            "癸亥";
    let ret = -1;
    let arr = data.split("\n");
    //日柱，时柱
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] == bz[6] + bz[7]) {
            ret = i + 1;
            break;
        }
    }
    return ret;
}

function getIndex7_3(bz) {
    let data = "甲\n" +
            "乙\n" +
            "丙\n" +
            "丁\n" +
            "戊\n" +
            "己\n" +
            "庚\n" +
            "辛\n" +
            "壬\n" +
            "癸";
    let ret = -1;
    let arr = data.split("\n");
    //日柱，时柱
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] == bz[4]) {
            ret = i + 1;
            break;
        }
    }
    return ret;
}

function getIndex8_1(bz) {
    let data = "甲子\n" +
            "甲丑\n" +
            "甲寅\n" +
            "甲卯\n" +
            "甲辰\n" +
            "甲巳\n" +
            "甲午\n" +
            "甲未\n" +
            "甲申\n" +
            "甲酉\n" +
            "甲戌\n" +
            "甲亥\n" +
            "乙子\n" +
            "乙丑\n" +
            "乙寅\n" +
            "乙卯\n" +
            "乙辰\n" +
            "乙巳\n" +
            "乙午\n" +
            "乙未\n" +
            "乙申\n" +
            "乙酉\n" +
            "乙戌\n" +
            "乙亥\n" +
            "丙子\n" +
            "丙丑\n" +
            "丙寅\n" +
            "丙卯\n" +
            "丙辰\n" +
            "丙巳\n" +
            "丙午\n" +
            "丙未\n" +
            "丙申\n" +
            "丙酉\n" +
            "丙戌\n" +
            "丙亥\n" +
            "丁子\n" +
            "丁丑\n" +
            "丁寅\n" +
            "丁卯\n" +
            "丁辰\n" +
            "丁巳\n" +
            "丁午\n" +
            "丁未\n" +
            "丁申\n" +
            "丁酉\n" +
            "丁戌\n" +
            "丁亥\n" +
            "戊子\n" +
            "戊丑\n" +
            "戊寅\n" +
            "戊卯\n" +
            "戊辰\n" +
            "戊巳\n" +
            "戊午\n" +
            "戊未\n" +
            "戊申\n" +
            "戊酉\n" +
            "戊戌\n" +
            "戊亥\n" +
            "己子\n" +
            "己丑\n" +
            "己寅\n" +
            "己卯\n" +
            "己辰\n" +
            "己巳\n" +
            "己午\n" +
            "己未\n" +
            "己申\n" +
            "己酉\n" +
            "己戌\n" +
            "己亥\n" +
            "庚子\n" +
            "庚丑\n" +
            "庚寅\n" +
            "庚卯\n" +
            "庚辰\n" +
            "庚巳\n" +
            "庚午\n" +
            "庚未\n" +
            "庚申\n" +
            "庚酉\n" +
            "庚戌\n" +
            "庚亥\n" +
            "辛子\n" +
            "辛丑\n" +
            "辛寅\n" +
            "辛卯\n" +
            "辛辰\n" +
            "辛巳\n" +
            "辛午\n" +
            "辛未\n" +
            "辛申\n" +
            "辛酉\n" +
            "辛戌\n" +
            "辛亥\n" +
            "壬子\n" +
            "壬丑\n" +
            "壬寅\n" +
            "壬卯\n" +
            "壬辰\n" +
            "壬巳\n" +
            "壬午\n" +
            "壬未\n" +
            "壬申\n" +
            "壬酉\n" +
            "壬戌\n" +
            "壬亥\n" +
            "癸子\n" +
            "癸丑\n" +
            "癸寅\n" +
            "癸卯\n" +
            "癸辰\n" +
            "癸巳\n" +
            "癸午\n" +
            "癸未\n" +
            "癸申\n" +
            "癸酉\n" +
            "癸戌\n" +
            "癸亥";
    let ret = -1;
    let arr = data.split("\n");
    //日柱，时柱
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] == bz[4] + bz[3]) {
            ret = i + 1;
            break;
        }
    }
    return ret;
}

function getIndex8_2(bz) {
    let data = "甲\n" +
            "乙\n" +
            "丙\n" +
            "丁\n" +
            "戊\n" +
            "己\n" +
            "庚\n" +
            "辛\n" +
            "壬\n" +
            "癸";
    let ret = -1;
    let arr = data.split("\n");
    //日柱，时柱
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] == bz[4]) {
            ret = i + 1;
            break;
        }
    }
    return ret;
}

function getIndex8_3(bz) {
    let data = "子\n" +
            "丑\n" +
            "寅\n" +
            "卯\n" +
            "辰\n" +
            "巳\n" +
            "午\n" +
            "未\n" +
            "申\n" +
            "酉\n" +
            "戌\n" +
            "亥\n";
    let ret = -1;
    let arr = data.split("\n");
    //日柱，时柱
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] == bz[3]) {
            ret = i + 1;
            break;
        }
    }
    return ret;
}

function getBookGeJi9(geju) {
    //HashMap<String, String[]> mapdata = new HashMap<String, String[]>();
    let mapData = {
        "论正官格": ["正官", "杂气正官"],
        "论七杀格": ["七杀", "杂气七杀"],
        "论偏正印格": ["正印", "杂气正印", "偏印", "杂气偏印"],
        "论偏正财格": ["正财", "杂气正财", "偏财", "杂气偏财"],
        "论食神格": ["食神", "杂气食神"],
        "论伤官格": ["伤官", "杂气伤官"],
        "论曲直格": ["曲直", "疑似曲直"],
        "论炎上格": ["炎上", "疑似炎上"],
        "论稼穑格": ["稼穑", "疑似稼穑"],
        "论从革格": ["从革", "疑似从革"],
        "论润下格": ["润下", "疑似润下"],
        "论从财格": ["从财", "疑似从财"],
        "论从杀格": ["从杀", "疑似从杀"],
        "论从儿格": ["从儿", "疑似从儿"],
        "论从旺格": ["曲直", "疑似曲直", "炎上", "疑似炎上", "稼穑", "疑似稼穑", "从革", "疑似从革", "润下", "疑似润下"],
        "论从强格": ["专旺", "疑似专旺"],
        "论建禄格": ["建禄"],
        "论月刃格": ["羊刃"],
        "论正官": ["正官", "杂气正官"],
        "论七杀": ["七杀", "杂气七杀"],
        "论偏正财": ["正财", "偏财", "杂气正财", "杂气偏财"],
        "论偏正印": ["正印", "偏印", "杂气正印", "杂气偏印"],
        "论食神": ["食神", "杂气食神"],
        "论伤官": ["伤官", "杂气伤官"],
        "论比肩禄刃": ["建禄", "羊刃"],
    }
    let ret = [];
    for (const key in mapData) {
        if (Object.hasOwnProperty.call(mapData, key)) {
            const element = mapData[key];
            for (let i = 0; i < element.length; i++) {
                let item = element[i];
                if (item == geju) {
                    if (ret.indexOf(key)) {
                        ret.push(key)
                    }
                }
            }
        }
    }
    return ret;
}

function getIndex9_1(bz,geju) {
    let data = "论正官格\n" +
            "论七杀格\n" +
            "论偏正印格\n" +
            "论偏正财格\n" +
            "论食神格\n" +
            "论伤官格\n" +
            "论曲直格\n" +
            "论炎上格\n" +
            "论稼穑格\n" +
            "论从革格\n" +
            "论润下格\n" +
            "论从财格\n" +
            "论从杀格\n" +
            "论从儿格\n" +
            "论从旺格\n" +
            "论从强格\n" +
            "论建禄格\n" +
            "论月刃格\n" +
            "论正官\n" +
            "论七杀\n" +
            "论偏正财\n" +
            "论偏正印\n" +
            "论食神\n" +
            "论伤官\n" +
            "论比肩禄刃";
    let ret = -1;
    let arr = data.split("\n");
    //日柱，时柱
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] == geju) {
            ret = i + 1;
            break;
        }
    }
    return ret;
}

function getIndex10_1(bz) {
    let data = "甲子\n" +
            "乙丑\n" +
            "丙寅\n" +
            "丁卯\n" +
            "戊辰\n" +
            "己巳\n" +
            "庚午\n" +
            "辛未\n" +
            "壬申\n" +
            "癸酉\n" +
            "甲戌\n" +
            "乙亥\n" +
            "丙子\n" +
            "丁丑\n" +
            "戊寅\n" +
            "己卯\n" +
            "庚辰\n" +
            "辛巳\n" +
            "壬午\n" +
            "癸未\n" +
            "甲申\n" +
            "乙酉\n" +
            "丙戌\n" +
            "丁亥\n" +
            "戊子\n" +
            "己丑\n" +
            "庚寅\n" +
            "辛卯\n" +
            "壬辰\n" +
            "癸巳\n" +
            "甲午\n" +
            "乙未\n" +
            "丙申\n" +
            "丁酉\n" +
            "戊戌\n" +
            "己亥\n" +
            "庚子\n" +
            "辛丑\n" +
            "壬寅\n" +
            "癸卯\n" +
            "甲辰\n" +
            "乙巳\n" +
            "丙午\n" +
            "丁未\n" +
            "戊申\n" +
            "己酉\n" +
            "庚戌\n" +
            "辛亥\n" +
            "壬子\n" +
            "癸丑\n" +
            "甲寅\n" +
            "乙卯\n" +
            "丙辰\n" +
            "丁巳\n" +
            "戊午\n" +
            "己未\n" +
            "庚申\n" +
            "辛酉\n" +
            "壬戌\n" +
            "癸亥";
    let ret = -1;
    let arr = data.split("\n");
    //日柱，时柱
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] ==bz[4] + bz[5]) {
            ret = i + 1;
            break;
        }
    }
    return ret;
}


function getIndex10_2(bz) {
    let data = "甲子\n" +
            "乙丑\n" +
            "丙寅\n" +
            "丁卯\n" +
            "戊辰\n" +
            "己巳\n" +
            "庚午\n" +
            "辛未\n" +
            "壬申\n" +
            "癸酉\n" +
            "甲戌\n" +
            "乙亥\n" +
            "丙子\n" +
            "丁丑\n" +
            "戊寅\n" +
            "己卯\n" +
            "庚辰\n" +
            "辛巳\n" +
            "壬午\n" +
            "癸未\n" +
            "甲申\n" +
            "乙酉\n" +
            "丙戌\n" +
            "丁亥\n" +
            "戊子\n" +
            "己丑\n" +
            "庚寅\n" +
            "辛卯\n" +
            "壬辰\n" +
            "癸巳\n" +
            "甲午\n" +
            "乙未\n" +
            "丙申\n" +
            "丁酉\n" +
            "戊戌\n" +
            "己亥\n" +
            "庚子\n" +
            "辛丑\n" +
            "壬寅\n" +
            "癸卯\n" +
            "甲辰\n" +
            "乙巳\n" +
            "丙午\n" +
            "丁未\n" +
            "戊申\n" +
            "己酉\n" +
            "庚戌\n" +
            "辛亥\n" +
            "壬子\n" +
            "癸丑\n" +
            "甲寅\n" +
            "乙卯\n" +
            "丙辰\n" +
            "丁巳\n" +
            "戊午\n" +
            "己未\n" +
            "庚申\n" +
            "辛酉\n" +
            "壬戌\n" +
            "癸亥";
    let ret = -1;
    let arr = data.split("\n");
    //日柱，时柱
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] == bz[6] + bz[7]) {
            ret = i + 1;
            break;
        }
    }
    return ret;
}

function getIndex10_3(bz) {
    let data = "甲\n" +
            "乙\n" +
            "丙\n" +
            "丁\n" +
            "戊\n" +
            "己\n" +
            "庚\n" +
            "辛\n" +
            "壬\n" +
            "癸";
    let ret = -1;
    let arr = data.split("\n");
    //日柱，时柱
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] == bz[4]) {
            ret = i + 1;
            break;
        }
    }
    return ret;
}

function getIndex10_4(bz) {
    let data = "金\n" +
            "木\n" +
            "水\n" +
            "火\n" +
            "土";
    let ret = -1;
    let arr = data.split("\n");
    //日柱，时柱
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] == wxForBz(bz[4])) {
            ret = i + 1;
            break;
        }
    }
    return ret;
}

function getIndex10_5(bz) {
    let data = "甲子丙寅\n" +
            "甲子己巳\n" +
            "甲子辛未\n" +
            "甲子乙亥\n" +
            "甲寅甲子\n" +
            "甲寅乙丑\n" +
            "甲寅丙寅\n" +
            "甲寅戊辰\n" +
            "甲寅己巳\n" +
            "甲寅辛未\n" +
            "甲辰乙丑\n" +
            "甲辰丙寅\n" +
            "甲辰庚午\n" +
            "甲辰甲戌\n" +
            "甲午甲子\n" +
            "甲午辛未\n" +
            "甲午壬申\n" +
            "甲午癸酉\n" +
            "甲申丙寅\n" +
            "甲申己巳\n" +
            "甲申辛未\n" +
            "甲戌甲子\n" +
            "甲戌丙寅\n" +
            "甲戌辛卯\n" +
            "甲戌乙亥\n" +
            "乙丑戊寅\n" +
            "乙丑己卯\n" +
            "乙丑辛未\n" +
            "乙丑甲申\n" +
            "乙丑乙酉\n" +
            "乙丑丁亥\n" +
            "乙卯丙子\n" +
            "乙卯己卯\n" +
            "乙卯壬午\n" +
            "乙卯甲申\n" +
            "乙巳甲申\n" +
            "乙巳丙戌\n" +
            "乙巳丁亥\n" +
            "乙未丙子\n" +
            "乙未丁亥\n" +
            "乙酉丙子\n" +
            "乙酉己卯\n" +
            "乙酉丁亥\n" +
            "乙酉庚辰\n" +
            "乙亥丙子\n" +
            "乙亥庚辰\n" +
            "乙亥甲申\n" +
            "丙子壬辰\n" +
            "丙子癸巳\n" +
            "丙寅己丑\n" +
            "丙寅乙亥\n" +
            "丙寅庚寅\n" +
            "丙寅癸巳\n" +
            "丙辰庚寅\n" +
            "丙辰甲午\n" +
            "丙辰己亥\n" +
            "丙午壬辰\n" +
            "丙午癸巳\n" +
            "丙午丙申\n" +
            "丙午戊戌\n" +
            "丙午己亥\n" +
            "丙申戊子\n" +
            "丙申己丑\n" +
            "丙申癸巳\n" +
            "丙戌己丑\n" +
            "丙戌辛卯\n" +
            "丙戌癸巳\n" +
            "丙戌甲午\n" +
            "丙戌丙申\n" +
            "丁丑壬寅\n" +
            "丁丑丙午\n" +
            "丁丑戊申\n" +
            "丁卯壬寅\n" +
            "丁卯甲辰\n" +
            "丁卯丙午\n" +
            "丁卯辛亥\n" +
            "丁巳庚子\n" +
            "丁巳辛丑\n" +
            "丁巳壬寅\n" +
            "丁巳丙午\n" +
            "丁巳丁未\n" +
            "丁未壬寅\n" +
            "丁未丙午\n" +
            "丁未庚戌\n" +
            "丁酉壬寅\n" +
            "丁酉甲辰\n" +
            "丁酉丙午\n" +
            "丁酉辛亥\n" +
            "丁亥壬寅\n" +
            "丁亥甲辰\n" +
            "丁亥丙午\n" +
            "戊子甲寅\n" +
            "戊子乙卯\n" +
            "戊子丁巳\n" +
            "戊子戊午\n" +
            "戊寅癸亥\n" +
            "戊辰癸亥\n" +
            "戊辰乙卯\n" +
            "戊午甲寅\n" +
            "戊午丁巳\n" +
            "戊午癸亥\n" +
            "戊申壬子\n" +
            "戊申丁巳\n" +
            "戊申己未\n" +
            "戊戌乙卯\n" +
            "戊戌丁巳\n" +
            "戊戌己未\n" +
            "己丑甲子\n" +
            "己丑庚午\n" +
            "己丑壬申\n" +
            "己丑甲戌\n" +
            "己丑丙寅\n" +
            "己卯丙寅\n" +
            "己卯庚午\n" +
            "己卯甲戌\n" +
            "己卯乙亥\n" +
            "己巳甲子\n" +
            "己巳庚午\n" +
            "己巳甲戌\n" +
            "己巳乙亥\n" +
            "己未甲子\n" +
            "己未庚午\n" +
            "己未丙寅\n" +
            "己酉丙寅\n" +
            "己酉庚午\n" +
            "己亥丙寅\n" +
            "己亥庚午\n" +
            "己亥壬申\n" +
            "庚子丙子\n" +
            "庚子甲申\n" +
            "庚子丁亥\n" +
            "庚寅丁丑\n" +
            "庚寅戊寅\n" +
            "庚寅丁亥\n" +
            "庚辰辛巳\n" +
            "庚辰壬午\n" +
            "庚辰乙酉\n" +
            "庚午丙子\n" +
            "庚午癸未\n" +
            "庚午甲申\n" +
            "庚午丁亥\n" +
            "庚申丁丑\n" +
            "庚申甲申\n" +
            "庚申乙酉\n" +
            "庚戌丙子\n" +
            "庚戌戊寅\n" +
            "庚戌壬午\n" +
            "庚戌癸未\n" +
            "庚戌甲申\n" +
            "辛丑己丑\n" +
            "辛丑庚寅\n" +
            "辛丑癸巳\n" +
            "辛丑丙申\n" +
            "辛丑丁酉\n" +
            "辛丑己亥\n" +
            "辛卯庚寅\n" +
            "辛卯戊子\n" +
            "辛卯丙申\n" +
            "辛巳庚寅\n" +
            "辛巳戊子\n" +
            "辛巳癸巳\n" +
            "辛巳甲午\n" +
            "辛巳丙申\n" +
            "辛巳丁酉\n" +
            "辛未戊子\n" +
            "辛未庚寅\n" +
            "辛未丁酉\n" +
            "辛未丙申\n" +
            "辛未己亥\n" +
            "辛酉戊子\n" +
            "辛酉庚寅\n" +
            "辛酉壬辰\n" +
            "辛酉癸巳\n" +
            "辛酉丙申\n" +
            "辛酉丁酉\n" +
            "辛亥戊子\n" +
            "辛亥庚寅\n" +
            "辛亥壬辰\n" +
            "辛亥丁酉\n" +
            "壬子壬寅\n" +
            "壬子辛亥\n" +
            "壬寅庚子\n" +
            "壬寅壬寅\n" +
            "壬寅丁未\n" +
            "壬寅辛亥\n" +
            "壬辰壬寅\n" +
            "壬辰甲辰\n" +
            "壬辰己酉\n" +
            "壬辰辛亥\n" +
            "壬午壬寅\n" +
            "壬午癸卯\n" +
            "壬午甲辰\n" +
            "壬午丁未\n" +
            "壬午辛亥\n" +
            "壬申壬寅\n" +
            "壬申甲辰\n" +
            "壬申辛亥\n" +
            "壬戌壬寅\n" +
            "壬戌庚戌\n" +
            "癸丑甲寅\n" +
            "癸丑丙寅\n" +
            "癸丑戊午\n" +
            "癸丑庚申\n" +
            "癸卯癸丑\n" +
            "癸卯乙卯\n" +
            "癸卯辛丑\n" +
            "癸卯癸辛\n" +
            "癸巳壬子\n" +
            "癸巳甲寅\n" +
            "癸巳庚申\n" +
            "癸未甲寅\n" +
            "癸未丙辰\n" +
            "癸未癸亥\n" +
            "癸酉丙辰\n" +
            "癸酉庚申\n" +
            "癸酉癸亥\n" +
            "癸亥壬子\n" +
            "癸亥甲寅\n" +
            "癸亥戊午\n" +
            "癸亥庚申\n" +
            "癸亥癸亥";
    let ret = -1;
    let arr = data.split("\n");
    //日柱，时柱
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] == bz[4] + bz[5] + bz[6] + bz[7]) {
            ret = i + 1;
            break;
        }
    }
    return ret;
}

function getIndex10_6_Title(bz) {
    let data = "寅\n" +
            "卯\n" +
            "辰\n" +
            "巳\n" +
            "午\n" +
            "未\n" +
            "申\n" +
            "酉\n" +
            "戌\n" +
            "亥\n" +
            "子\n" +
            "丑";

    let retArr = ["论正月节气", "论二月节气", "论三月节气", "论四月节气", "论五月节气", "论六月节气", "论七月节气", "论八月节气", "论九月节气", "论十月节气", "论十一月节气", "论十二月节气"];
    let ret = "";
    let arr = data.split("\n");
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] == bz[3]) {
            ret = retArr[i];
            break;
        }
    }
    return ret;
}

function getIndex10_6(bz) {
    let data = "寅\n" +
            "卯\n" +
            "辰\n" +
            "巳\n" +
            "午\n" +
            "未\n" +
            "申\n" +
            "酉\n" +
            "戌\n" +
            "亥\n" +
            "子\n" +
            "丑";
    let ret = -1;
    let arr = data.split("\n");
    //日柱，时柱
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] == bz[3]) {
            ret = i + 1;
            break;
        }
    }
    return ret;
}


function getIndex11_1(bz) {
    let data = "甲子\n" +
            "乙丑\n" +
            "丙寅\n" +
            "丁卯\n" +
            "戊辰\n" +
            "己巳\n" +
            "庚午\n" +
            "辛未\n" +
            "壬申\n" +
            "癸酉\n" +
            "甲戌\n" +
            "乙亥\n" +
            "丙子\n" +
            "丁丑\n" +
            "戊寅\n" +
            "己卯\n" +
            "庚辰\n" +
            "辛巳\n" +
            "壬午\n" +
            "癸未\n" +
            "甲申\n" +
            "乙酉\n" +
            "丙戌\n" +
            "丁亥\n" +
            "戊子\n" +
            "己丑\n" +
            "庚寅\n" +
            "辛卯\n" +
            "壬辰\n" +
            "癸巳\n" +
            "甲午\n" +
            "乙未\n" +
            "丙申\n" +
            "丁酉\n" +
            "戊戌\n" +
            "己亥\n" +
            "庚子\n" +
            "辛丑\n" +
            "壬寅\n" +
            "癸卯\n" +
            "甲辰\n" +
            "乙巳\n" +
            "丙午\n" +
            "丁未\n" +
            "戊申\n" +
            "己酉\n" +
            "庚戌\n" +
            "辛亥\n" +
            "壬子\n" +
            "癸丑\n" +
            "甲寅\n" +
            "乙卯\n" +
            "丙辰\n" +
            "丁巳\n" +
            "戊午\n" +
            "己未\n" +
            "庚申\n" +
            "辛酉\n" +
            "壬戌\n" +
            "癸亥";
    let ret = -1;
    let arr = data.split("\n");
    //日柱，时柱
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] == bz[4] + bz[5]) {
            ret = i + 1;
            break;
        }
    }
    return ret;
}

function getIndex11_2(bz) {
    let data = "甲子\n" +
            "乙丑\n" +
            "丙寅\n" +
            "丁卯\n" +
            "戊辰\n" +
            "己巳\n" +
            "庚午\n" +
            "辛未\n" +
            "壬申\n" +
            "癸酉\n" +
            "甲戌\n" +
            "乙亥\n" +
            "丙子\n" +
            "丁丑\n" +
            "戊寅\n" +
            "己卯\n" +
            "庚辰\n" +
            "辛巳\n" +
            "壬午\n" +
            "癸未\n" +
            "甲申\n" +
            "乙酉\n" +
            "丙戌\n" +
            "丁亥\n" +
            "戊子\n" +
            "己丑\n" +
            "庚寅\n" +
            "辛卯\n" +
            "壬辰\n" +
            "癸巳\n" +
            "甲午\n" +
            "乙未\n" +
            "丙申\n" +
            "丁酉\n" +
            "戊戌\n" +
            "己亥\n" +
            "庚子\n" +
            "辛丑\n" +
            "壬寅\n" +
            "癸卯\n" +
            "甲辰\n" +
            "乙巳\n" +
            "丙午\n" +
            "丁未\n" +
            "戊申\n" +
            "己酉\n" +
            "庚戌\n" +
            "辛亥\n" +
            "壬子\n" +
            "癸丑\n" +
            "甲寅\n" +
            "乙卯\n" +
            "丙辰\n" +
            "丁巳\n" +
            "戊午\n" +
            "己未\n" +
            "庚申\n" +
            "辛酉\n" +
            "壬戌\n" +
            "癸亥";
    let ret = -1;
    let arr = data.split("\n");
    //日柱，时柱
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] == bz[0] + bz[1]) {
            ret = i + 1;
            break;
        }
    }
    return ret;
}

// 判断干支是否阴阳
function getGZYinYang(gz) {
    if (gz == "甲" || gz == "丙" || gz == "戊" || gz == "庚" || gz == "壬" ||
      gz == "子" || gz == "寅" || gz == "辰" || gz == "午" || gz == "申" || gz == "酉") {
      return 1;
    } else {
      return 0;
    }
}

function wxForBz(item) {
    var wx = "";
    if (item == "甲" || item == "乙" || item == "寅" || item == "卯") {
      wx = "木";
    }
    if (item == "丙" || item == "丁" || item == "巳" || item == "午") {
      wx = "火";
    }
    if (item == "戊" || item == "己" || item == "丑" || item == "辰" ||
      item == "未" || item == "戌") {
      wx = "土";
    }
    if (item == "庚" || item == "辛" || item == "申" || item == "酉") {
      wx = "金";
    }
    if (item == "壬" || item == "癸" || item == "子" || item == "亥") {
      wx = "水";
    }
    return wx;
}

module.exports = {
    getGuji1_branch: getGuji1_branch,
    getGuji2_branch: getGuji2_branch,
    getGuji3_branch: getGuji3_branch,
    getGuji4_branch: getGuji4_branch,
    getGuji5_branch: getGuji5_branch,
    getGuji6_branch: getGuji6_branch,
    getGuji7_branch: getGuji7_branch,
    getGuji8_branch: getGuji8_branch,
    getGuji9_branch: getGuji9_branch,
    getGuji10_branch: getGuji10_branch,
    getGuji11_branch: getGuji11_branch,
    getIndex1_1: getIndex1_1,
    getIndex2_1: getIndex2_1,
    getIndex2_2: getIndex2_2,
    getIndex3_1: getIndex3_1,
    getIndex3_2: getIndex3_2,
    getIndex3_3: getIndex3_3,
    getIndex3_4: getIndex3_4,
    getIndex4_1: getIndex4_1,
    getIndex5_1: getIndex5_1,
    getIndex6_1: getIndex6_1,
    getIndex6_2: getIndex6_2,
    getIndex6_3: getIndex6_3,
    getIndex6_4: getIndex6_4,
    getIndex7_1: getIndex7_1,
    getIndex7_2: getIndex7_2,
    getIndex7_3: getIndex7_3,
    getIndex8_1: getIndex8_1,
    getIndex8_2: getIndex8_2,
    getIndex8_3: getIndex8_3,
    getIndex9_1: getIndex9_1,
    getIndex10_1: getIndex10_1,
    getIndex10_2: getIndex10_2,
    getIndex10_3: getIndex10_3,
    getIndex10_4: getIndex10_4,
    getIndex10_5: getIndex10_5,
    getIndex10_6: getIndex10_6,
    getIndex11_1: getIndex11_1,
    getIndex11_2: getIndex11_2,
}