const MingJuRiGan = {
  甲: {
    乙: '劫财',
    甲: '比肩',
    丁: '伤官',
    丙: '食神',
    癸: '正印',
    壬: '偏印',
    己: '正财',
    戊: '偏财',
    辛: '正官',
    庚: '七杀',
  },
  乙: {
    乙: '比肩',
    甲: '劫财',
    丁: '食神',
    丙: '伤官',
    癸: '偏印',
    壬: '正印',
    己: '偏财',
    戊: '正财',
    辛: '七杀',
    庚: '正官',
  },
  丙: {
    乙: '正印',
    甲: '偏印',
    丁: '劫财',
    丙: '比肩',
    癸: '正官',
    壬: '七杀',
    己: '伤官',
    戊: '食神',
    辛: '正财',
    庚: '偏财',
  },
  丁: {
    乙: '偏印',
    甲: '正印',
    丁: '比肩',
    丙: '劫财',
    癸: '七杀',
    壬: '正官',
    己: '食神',
    戊: '伤官',
    辛: '偏财',
    庚: '正财',
  },
  戊: {
    乙: '正官',
    甲: '七杀',
    丁: '正印',
    丙: '偏印',
    癸: '正财',
    壬: '偏财',
    己: '劫财',
    戊: '比肩',
    辛: '伤官',
    庚: '食神',
  },
  己: {
    乙: '七杀',
    甲: '正官',
    丁: '偏印',
    丙: '正印',
    癸: '偏财',
    壬: '正财',
    己: '比肩',
    戊: '劫财',
    辛: '食神',
    庚: '伤官',
  },

  庚: {
    乙: '正财',
    甲: '偏财',
    丁: '正官',
    丙: '七杀',
    癸: '伤官',
    壬: '食神',
    己: '正印',
    戊: '偏印',
    辛: '劫财',
    庚: '比肩',
  },

  辛: {
    乙: '偏财',
    甲: '正财',
    丁: '七杀',
    丙: '正官',
    癸: '食神',
    壬: '伤官',
    己: '偏印',
    戊: '正印',
    辛: '比肩',
    庚: '劫财',
  },

  壬: {
    乙: '伤官',
    甲: '食神',
    丁: '正财',
    丙: '偏财',
    癸: '劫财',
    壬: '比肩',
    己: '正官',
    戊: '七杀',
    辛: '正印',
    庚: '偏印',
  },

  癸: {
    乙: '食神',
    甲: '伤官',
    丁: '偏财',
    丙: '正财',
    癸: '比肩',
    壬: '劫财',
    己: '七杀',
    戊: '正官',
    辛: '偏印',
    庚: '正印',
  },
}

const DiZhiToTianGan = {
  子: '癸',
  丑: '己',
  寅: '甲',
  卯: '乙',
  辰: '戊',
  巳: '丙',
  午: '丁',
  未: '己',
  申: '庚',
  酉: '辛',
  戌: '戊',
  亥: '壬',
}

/**
 * 获取十神
 * @param {String} rz 日主
 * @param {String} gz 干/支
 */
export const getSSOfGZ = (rz, gz) => {
  if (!gz || gz == '*') return '**'
  if (DiZhiToTianGan[gz]) {
    gz = DiZhiToTianGan[gz]
  }
  return MingJuRiGan[rz][gz]
}
